[
  {
    "name": "IFC - International Finance Corporation",
    "link": "https://www.linkedin.com/company/ifclinkedin/",
    "overview": "IFC, a member of the World Bank Group, is the largest global development institution focused exclusively on the private sector in developing countries.\n\nWe utilize and leverage our products and services—as well as products and services of other institutions in the World Bank Group—to provide development solutions customized to meet clients’ needs. We apply our financial resources, technical expertise, global experience, and innovative thinking to help our partners overcome financial, operational, and political challenges.\n\nClients view IFC as a provider and mobilizer of scarce capital, knowledge, and long-term partnerships that can help address critical constraints in areas such as finance, infrastructure, employee skills, and the regulatory environment.\n\nIFC is also a leading mobilizer of third-party resources for its projects. Our willingness to engage in difficult environments and our leadership in crowding-in private finance enable us to extend our footprint and have a development impact well beyond our direct resources.\n\nFor more information, visit www.ifc.org.\n\n"
  },
  {
    "name": "Banky Egypt",
    "link": "https://www.linkedin.com/company/banky-egypt/",
    "overview": "Banky Gate, Is the first specialized Gate for banking services , jobs  and news, which offers the first banking bulletin aimed at saving time, efforts, and money for individuals, in addition to spread banking awareness in line with achieving Financial Inclusion and digital transformation \n"
  },
  {
    "name": "e-finance",
    "link": "https://www.linkedin.com/company/e-finance/",
    "overview": "e-finance is a pioneer national developer of digital payments infrastructure, FinTech leaders and architects of digital space, known as the Digital Partner of Choice for Egypt’s growing digital economy and financial digital transformation\n\nShare holders:\n\ne-finance is operating the Egyptian government financial network. Being a national company, with a paid capital of 800 Million EGP, e-finance’s shareholders are:\n\nNational Investment Bank (63.64%),\nNational Bank of Egypt (9.09%),\nBanque Misr (9.09%),\nEgyptian Banks Company-EBC (9.09%)\nEgyptian Company for Investment projects (9.09%)."
  },
  {
    "name": "African Export-Import Bank (Afreximbank)",
    "link": "https://www.linkedin.com/company/african-export-import-bank/",
    "overview": "The African Export-Import Bank (Afreximbank) is the foremost Pan-African multilateral financial institution devoted to financing and promoting intra- and extra-African trade. The Bank was established in October 1993 by African governments, African private and institutional investors, and non-African investors. Its two basic constitutive documents are the Establishment Agreement, which gives it the status of an international organization, and the Charter, which governs its corporate structure and operations."
  },
  {
    "name": "Beltone Financial",
    "link": "https://www.linkedin.com/company/beltone-financial/",
    "overview": "Beltone Financial was formed in 2002 by leaders of the financial community in the Middle East and North Africa, and is currently one of the leading investment banks in the region. With almost 250 professionals, Beltone Financial serves its clients from a network of offices in Cairo and Dubai. We serve institutional investors and currently have over 100 institutional customers from all regions of the globe trading with us in all world & Middle East markets. Our business is to ensure that our customers receive the same high standards that they expect from their developed market brokers."
  },
  {
    "name": "CI Capital Holding",
    "link": "https://www.linkedin.com/company/cicapital/",
    "overview": "CI Capital is a leading diversified financial services group that offers a suite of non-bank financial solutions catered to a wide spectrum of clients. \nLeasing | Microfinance | Investment Banking "
  },
  {
    "name": "valU",
    "link": "https://www.linkedin.com/company/valuegypt/",
    "overview": "valU is a lifestyle enabling solution which empowers customers shopping experience while ensuring convenience & ease of use.\n\nFeaturing Egypt's fastest credit decision process, banked customers receive instant feedback on their limits once they deliver their documents to valU, while unbanked customers only take 24-48 hours to receive their feedback. \n\nBuilt on a sophisticated algorithm, valU is a state-of-the-art Fintech solution that transforms your smart phone into a payment-by-installments platform that lets you shop across the most sought-after brands and stores in Egypt.\n"
  },
  {
    "name": "Prime Holding",
    "link": "https://www.linkedin.com/company/prime-holding/",
    "overview": "Prime Holding is ranking one of the Leading investment banks in Egypt, offering a full range of financial services, including the highest quality fund and portfolio management, corporate finance and private equity to an extended client base, spanning the continents. Our company Securities SAE affiliate is a member of the Cairo and Alexandria Stock Exchange, sporting a highly trained brokers and sales team, as well as up to the minute research reports and investment recommendations."
  },
  {
    "name": "Khazna",
    "link": "https://www.linkedin.com/company/khazna/",
    "overview": "Khazna was founded in April 2019 with a mission to improve the financial well-being of 20M+ underbanked Egyptians who have little access to formal financial services by providing access to convenient, effective and secure smartphone based financial services.\n\nThe company is led by a team with over 50 years of combined global experience in finance, corporate strategy and technology. Furthermore, the company has also closed an initial round of funding from leading local and international fintech funds and investors."
  },
  {
    "name": "HC Securities & Investment",
    "link": "https://www.linkedin.com/company/hc-securities-&-investment/",
    "overview": "HC Securities & Investment (HC) is a leading investment bank in Egypt and the MENA region. Since its inception in 1996, HC has utilized its relationship-driven insights, local and regional market knowledge, and industry-specific expertise and strong execution capabilities to provide its clients with a wide range of services in investment banking, asset management, securities brokerage, research, custody, online trading and private equity through its offices in Egypt and the UAE (DIFC). HC Investment Banking has an outstanding track record of advising leading corporates in Egypt and the MENA region on M&A, capital market, and financing transactions in excess of USD5.8bn. HC Asset Management, winner of the 2018 MENA Fund Manager Awards, now manages 12 mutual funds for commercial banks and portfolios for institutions and sovereign wealth funds with assets under management in excess of EGP7bn. HC Brokerage is ranked among the top brokers in Egypt and provides a wide array of services, including research and online trading to institutional and retail clients."
  },
  {
    "name": "Nearshore ME - Audit, Tax & Advisory Firm",
    "link": "https://www.linkedin.com/company/nearshore-middle-east/",
    "overview": "Nearshore Middle East is an Egyptian Audit, Tax and Advisory Firm, providing external audit and taxation services, offers a wide range of accounting, tax and business advisory services, capital markets, litigation support, corporate finance, VAT planning, project management and financial services. Nearshore Middle East has first-class expertise focused on providing solutions to help customers thrive.\nNearshore Middle East is a member of RT ASEAN, which is a member of The Forum of Firms.\nRT ASEAN is the first Singapore branded regional network of Accounting and Multi-disciplinary professionals focusing on client needs across Asia-Pacific and beyond. The network specializes in providing a comprehensive suite of professional services which can be broadly defined into 3 core areas - Financial, Digital, and Legal Solutions. Backed by established Accounting, Legal, and Digital firms, RT ASEAN is also the first and only global professional network in Asia to be recognized as a member of the Forum of Firms by IFAC.\nThe Forum of Firms (FOF, Forum) is an independent association of international networks of firms that perform transnational audits. The objective of the Forum is to promote consistent and high-quality standards of financial reporting and auditing practices worldwide—bringing together firms that perform transnational audits and involving them more closely with IFAC’s activities in audit and other assurance-related areas. Members of the FoF must demonstrate their commitment to adhere to and promote the consistent application of high-quality audit practices worldwide."
  },
  {
    "name": "AMAN for E-Payments",
    "link": "https://www.linkedin.com/company/aman-for-e-payments/",
    "overview": "AMAN is a young FINTECH company that pledges a better quality of life to people through convenient, easy and available financial services based on in‐depth understanding of people's needs, continuous innovation and rapid response to market demand, ensuing adequate coverage and a substantial & relevant services."
  },
  {
    "name": "FinTech Egypt",
    "link": "https://www.linkedin.com/company/fintechegyptofficial/",
    "overview": "Fintech Egypt is a unified platform to foster and connect all Fintech ecosystem stakeholders, including Fintech startups, financial institutions, regulators, service providers, mentors and investors."
  },
  {
    "name": "The First MicroFinance Company - Egypt",
    "link": "https://www.linkedin.com/company/fmfc-egypt/",
    "overview": "The First MicroFinance Company – Egypt (FMFC-E), founded by the Aga Khan Agency for Microfinance (AKAM), part of the larger Aga Khan Development Network (AKDN), is committed to increasing financial inclusion and alleviating poverty by boosting socio-economic development within low-income communities. FMFC-E aims at providing easy access to a wide range of financial products and services in rural and urban areas to support clients in joining the mainstream financial system, becoming self-reliant, and contributing to the improvement of their living standards."
  },
  {
    "name": "Egypt Factors",
    "link": "https://www.linkedin.com/company/egypt-factors/",
    "overview": "> Who we are\nEgypt Factors is the first licensed Egyptian company specialising in factoring services. It has been established on November 14th, 2006, under company registration no. 21145 as a joint stock company equipped with a paid-in capital of USD 25 million.\n\nOver the years, Egypt Factors has established a reputation as a company that is extremely responsive to clients’ individual requirements. The cornerstone of the company’s success has been the provision of a quality accounts receivable management service with together tailor-made finance based on underlying commercial trade transactions, and thereby supporting suppliers in meeting their buyers’ expectations.\n\nClassified as a non-bank financial institution, Egypt Factors falls under the supervision and control of the Financial Regulatory Authority (FRA), which is the primary governmental authority concerned with regulating and facilitating the non-bank financial sector in Egypt.\n\nOur Mission\nTo facilitate the international and local trade through providing structured commercial finance facilities. Enabling the businesses to finance working capital business need, conclude cross borders deals and accelerate their business Cycles and sales growth.\n\nOur Vision\nContinue to lead in the international factoring business within the Arab and African region and to be a multibillion-dollar factoring company.\n"
  },
  {
    "name": "Abdul Latif Jameel Finance - Egypt",
    "link": "https://www.linkedin.com/company/abdul-latif-jameel-finance-egypt/",
    "overview": "We want to open doors for our partners, consumers, and commercial clients through a portfolio of tailored financial products supported by superior customer service and flexible terms and conditions."
  },
  {
    "name": "Enmaa Finance Company",
    "link": "https://www.linkedin.com/company/enmaa-finance-company/",
    "overview": "Enmaa Finance Company was founded in 2015 as a joint stock company under The Islamic Corporation for the Development of the Private Sector (ICD), Arab Investment Bank (AIBK) and Ayady for Investment and Development Company providing Shari’a compliant leasing and factoring solutions for a wide variety of businesses through improving business cash flow and financing commercial and administrative real estate, transportation, IT equipment, industrial equipment, used equipment sales, and upgrading, expanding or purchasing of new production lines and machinery.\n\n"
  },
  {
    "name": "GlobalCorp-",
    "link": "https://www.linkedin.com/company/global-leasing-company/",
    "overview": "Global Leasing Company “GLC” was established during Q1 2015 as an Egyptian Joint Stock Company under the provisions of Law # 8 for the year 1997 & its executive regulations, with an authorized capital of EGP 500MM and Issued Capital of EGP 50MM. GLC is founded by renowned local and international financial institutions, including Ezdehar Management and SANAD Fund (a subsidiary of the German BMZ, KFW and the Swiss State Secretariat for Economic Affairs SECO)\n\nGLC provides highly structured leasing products and other financial & advisory services to the Egyptian market with a focus on specific markets & industries, including but not limited to; Real Estate Development, Transportation, Healthcare, Education, Pharmaceuticals, Food & Beverage, paper, Chemicals and Oil Services for both SMEs and large corporate market players.\n\nThe purpose of GLC’s operations is to offer a full range of international-standard leasing products, including products that provide accessible, transparent and competitive financial leases for large corporate, small and medium-sized enterprises and entrepreneurs in Egypt. GLC will also have a social responsibility mission to alleviate poverty and foster the creation of employment in Egypt, as an institution with a dual focus to generate commercial returns whilst remaining committed to a strong social mission"
  },
  {
    "name": "Premium Card",
    "link": "https://www.linkedin.com/company/premium-card/",
    "overview": "Premium Card is the first truly guaranteed interest-free and bank-free instalment card in Egypt. With Premium Card, cardholders can buy now and pay later over 10 monthly instalments at an unprecedented 0% interest rate. We deal with a large and very diverse network of merchants across all trades for the convenience of our customers. We have been in operation for 15 years and more to come. \nYour employees can enjoy the many benefits of becoming cardholders to enjoy the “Premium Card” shopping experience. \nYour business can benefit from Premium Card to guarantee maximum employee satisfaction rates. \nFor more information refer to our website http://www.premiumcard.net/\nبريميوم كارد أول بطاقة تقسيط مصرية تتيح لكم متعة التسوق بدون فوائد وبدون الحاجة إلى بنك. يمكنكم الشراء الآن والدفع لاحقاً بالتقسيط على 10 شهور بنسبة 0% فوائد. تتكون شبكة بريميوم كارد من العديد من المحلات والبائعين من أجل راحة عملائنا. بدأت بريميوم كارد العمل عام 2002 وتحتفل بعامها الخامس عشر.\nتقوم بريميوم كارد بخدمة الشركات والمؤسسات من أجل توفير فوائد للموظفين و تعظيم قوتهم الشرائية بدون ضغوط . استفد الآن من خدمات بريميوم كارد في شركتك لضمان السعادة القصوى لموظفيك. لمزيد من المعلومات برجاء زيارة موقعنا http://www.premiumcard.net/\n\n"
  },
  {
    "name": "Qalaa Holdings",
    "link": "https://www.linkedin.com/company/citadel-capital-sae/",
    "overview": "After a successful decade-long run as Africa’s largest private equity firm, Citadel Capital is transforming into an investment holding company with a focus on infrastructure and industry.\r\n\r\nAs part of this transformation and in recognition of the close of our recent capital increase to EGP 8 bn via an EGP 3.64 bn share issuance, we are rebranding. Over the coming period, we are rolling out a slightly modified corporate logo, and our trade name in all materials will become Qalaa Holdings. The word \"Qalaa\" is a transliteration of the Arabic word القلعة.\r\n\r\nThe subtle shift in our English name to \"Qalaa\" from \"Citadel\" speaks to our fundamental confidence in the prospects across our footprint in Egypt and Africa.\r\n\r\nAt the present time, the firm's registered legal name as noted in its Egyptian Commercial Registration and other legal documentation remains temporarily unchanged: (القلعة للإستشارات المالية ش.م.م ) (Citadel Capital S.A.E.)."
  },
  {
    "name": "Aman For Micro Finance",
    "link": "https://www.linkedin.com/company/aman-for-micro-finance/",
    "overview": "AMAN for Microfinance, a subsidiary of Raya Holding for Financial Investment, established in 2018. Works as an arm for AMAN Financial services a leading FINTECH company in Egypt, providing suitable timely and diversified financial solutions for the unbanked or those who have limited access to funding empowered by advanced technology solutions to make the process easier, faster, and more beneficial.\nThe company has laid out a strong infrastructure of technical and technological capabilities. It has also agreed and signed a deal with a global leader for systems and electronic programs to provide a system for the exchange, collection, and follow up of the outgoing financials of microenterprise projects and businesses, a deal that constitutes a major surprise for the microfinance market in Egypt.\nAMAN for Micro-Finance is basing its strategy on attracting a select group of distinguished talents in the field of microfinance to serve as principal officials and executives. Such strategy is complemented with an aim to build a sustainable model for financing clients that is characterized by speed, flexibility, and creativity in a way that fits the nature of the field’s clientele and guarantees optimum efficiency both in terms of time and payments.\n"
  },
  {
    "name": "The Cairo Angels",
    "link": "https://www.linkedin.com/company/cairoangels/",
    "overview": "Cairo Angels is Egypt’s first formal angel investment network; investing in and supporting early-stage startups in Egypt and across the MENA region."
  },
  {
    "name": "Thndr",
    "link": "https://www.linkedin.com/company/thndrapp/",
    "overview": "thndr is Egypt's mobile first investment platform with 0% commission, no account minimum, access to real time news, market data and easy account setup and funding processes."
  },
  {
    "name": "CFA Society Egypt",
    "link": "https://www.linkedin.com/company/cfa-society-egypt/",
    "overview": "CFA Society Egypt was established in 2005 as a non-profit Egyptian association and became a member society of CFA Institute in 2006.\n\nObjectives:\n\nIncrease appreciation and awareness of the CFA designation among practitioners, employers, regulators, and the investing public, through:\n\n*Advertising the society, its activities and the CFA designation in local newspaper and magazines\n*Creating a web site to include information about the society and its activities\n*Issuing publications to cover the society’s activities and issues related to the financial profession\n*Holding one annual event\n*Sponsoring and participating in major local financial events\n*Hosting joint events with other entities\n*Creating a dialogue with potential CFA candidates\n\nEnhance communication within the investment community to foster market development, through:\n\n*Holding periodic member meetings\n*Holding regular meetings to disseminate the society’s values and objectives\n*Communicating the society’s views on specific investment issues to regulators through “statement of opinion”\n*Identifying areas that require reform and market development and providing related technical support\n*Fostering a dialogue between local practitioners and foreign counterparts to exchange ideas and best practices\n\nFoster professional development for society members and practitioners at large, through:\n\n*Creating a “career placement” mechanism to communicate employment opportunities to society members\n*Organizing educational programs, seminars and round tables\n\nPromote adoption of the CFA Institute Code of Ethics and Standards of Professional Conduct, through:\n\n*Leading by example\n*Communicating the code of Ethics to investment practitioners\n*Encouraging regulators and employers to formally adopt and enforce the Code of Ethics"
  },
  {
    "name": "Absolute Financial Advisors",
    "link": "https://www.linkedin.com/company/absolute-financial-advisors/",
    "overview": "Absolute Financial Advisors (Absolute FA) is a credit and financial consulting services provider company based in Cairo, Egypt.\r\n\r\nAbsolute FA is built up by a team of senior professionals who have extensive experience in the emerging and global markets over many economic cycles. \r\n \r\nAbsolute FA consulting services are supported by a comprehensive infrastructure in risk management, finance, accounting, legal, compliance, global operations, marketing, investor relations, & information technology.\r\n \r\nAbsolute FA is one of the main credit and financial consulting players in the GCC and African markets through the personalized tailored services which we create to match our clients’ requirements.  \r\n \r\nAbsolute FA presents a variety of credit and financial consulting services targeting Small, Midcap, and Corporate segments."
  },
  {
    "name": "Alexandria Business Association (SME Project)",
    "link": "https://www.linkedin.com/company/aba_sme/",
    "overview": "The Alexandria Business Association (ABA) is a non-profit founded in 1983 as a supporting institution to the private sector to promote the interests of the business community through the Alexandria Chamber of Commerce. ABA’s primary goals are to develop and promote existing small and microenterprises, raise the income of SMEs, help the transformations of SMEs from the informal sector to the formal sector, and contribute to solving the problems of unemployment. ABA assists over 300,000 clients through 64 locations in seven governorates. ABA has also developed and positioned the Middle East Training Center (METC) as a regional training center to develop capacity and promote best practice in the region. ABA’s efforts have not gone unnoticed; they are regularly awarded for their results on social performance, sustainable growth, and transparency. For more information, visit aba-sme.com."
  },
  {
    "name": "Kashat",
    "link": "https://www.linkedin.com/company/kashateg/",
    "overview": "\nكاشات هو اول تطبيق في مصر يقدم تمويل النانو من خلال الموبايل لمساعدة اصحاب الاعمال الصغيرة بكل سهولة ومن غير اجراءات معقدة.\n"
  },
  {
    "name": "Finance in Motion",
    "link": "https://www.linkedin.com/company/finance-in-motion/",
    "overview": "Finance in Motion is an impact asset manager focused on sustainable development finance. By bringing together public and private institutional investors as well as international financial institutions, we develop and advise alternative investment vehicles that cover a broad spectrum of development finance, including micro, small and medium enterprise finance and green finance. \nWith a current volume of over EUR 2.3 billion, the funds we advise have invested a cumulative total of more than EUR 5.1 billion in Southeast Europe, the Caucasus, Latin America, the Middle East, North Africa, and Sub-Saharan Africa through equity and debt financing placed largely with financial institutions. \nTechnical assistance projects accompany our investments to support our partners as well as develop financial markets in the countries we serve. \nOur international team of around 220 employees works from 17 offices around the globe. Finance in Motion is supervised by the German Federal Financial Supervisory authority. "
  },
  {
    "name": "Mediterrania Capital Partners",
    "link": "https://www.linkedin.com/company/mediterrania-capital-partners/",
    "overview": "Mediterrania Capital Partners is a dedicated Private Equity firm focusing on growth investments in SMEs and mid-cap companies in Africa. It invests in African SMEs with an annual turnover of €20 million to €300 million and expansion strategies into North and Sub-Saharan African markets.\n\nWith offices in Abidjan, Algiers, Barcelona, Cairo, Casablanca and Valletta, the company takes a proactive, hands-on approach to implementing the growth strategy of its portfolio companies by driving their Value Creation and ESG processes.\n\nMediterrania Capital Partners is a regulated financial investment manager licensed by the Malta Financial Services Authority (MFSA), the Financial Services Commission (FSC) in Mauritius and the Comisión Nacional del Mercado de Valores (CNMV) in Spain. "
  },
  {
    "name": "AFB Consulting",
    "link": "https://www.linkedin.com/company/afb-consulting/",
    "overview": "AFB Consulting – an Egyptian firm established in 2005, formed of a dynamic team of financial professionals with expert background in specialized financial services.\r\n\r\nThe company is specialized in Headhunting & Executive Search, Financial Training, and Staff Outsourcing.\r\n\r\nAFB Consulting founders are financial professionals with auditing and financial backgrounds coming from the big four auditing firms and other multinational companies; having a large network of auditors and accountants."
  },
  {
    "name": "The Sovereign Fund of Egypt",
    "link": "https://www.linkedin.com/company/the-sovereign-fund-of-egypt/",
    "overview": "The Sovereign Fund of Egypt was established in 2018 to attract private investments to Egypt and promote and co-invest in state-owned assets to maximize their value and efficiency for the Egyptian economy. The Fund is independently managed, through senior executives from the private sector, seeking to select investable assets from public stakeholders to promote and co invest in with local and foreign specialized and financial partners to create value, increase the private sector’s role in the economy and create jobs for Egypt’s young population. The Fund’s clout, acting through its special law, allows it to unlock unique assets for investors and engage the government to help implement structural reforms, ultimately increasing diversified economic growth. The Sovereign Fund of Egypt operates in accordance with globally accepted best practices in all respects, from its clear and disciplined investment focus to its governance. The Fund is overseen by a board of directors as well as a general assembly, both bodies having majority private sector members. The Sovereign Fund of Egypt was established in accordance with Law 177 of 2018; its articles of association were published in February 2019 by Prime Ministerial Decree 555 of 2019."
  },
  {
    "name": "On Time Solutions LLC",
    "link": "https://www.linkedin.com/company/on-time-solutions-llc/",
    "overview": "The Leaders in Online Credit Card Processing\nWe take the guesswork out of payment processing with solutions that fit you!"
  },
  {
    "name": "Pioneers Securities",
    "link": "https://www.linkedin.com/company/pioneers-securities/",
    "overview": "pioneers securities is a financial services company based out of 4 Abbas El Akkad St.,  Nasr City, Cairo, Egypt."
  },
  {
    "name": "Bayt El Khebra Group",
    "link": "https://www.linkedin.com/company/bayt-el-khebra-group/",
    "overview": "Welcome to BEK, a leading financer, financial services and business advisory group in Cairo, Egypt. Our services cover a multitude of industries, reflecting the diverse nature of Egypt’s dynamic emerging economy.\nBEK’s most valuable asset is its network of prominent business experts, all of whom are veteran leaders in their respective fields. Our experts understand the pulse of the national market and, consequently, have a solid track record in detecting emerging business trends.\nWe combine human talent with financial resources to help companies expand, restructure or streamline operations as needed.\nBEK is also a group holding company with several subsidiaries companies in the growing fields of finance leasing, real estate financing, investment and advisory, trade and distribution and manufacturing.\nWhile BEK specializes in the business of finance and advisory services, we have a deep appreciation for the potential role that business can play in economic development and social mobility. Beyond profits, our business plays a critical role in not only providing needed capital, but we also aim to develop our communities in which we operate, all of which contribute to the overall betterment of society. It is this holistic view of business and entrepreneurship that drives our efforts to help our clients with their endeavors."
  },
  {
    "name": "Al-Tiqnea",
    "link": "https://www.linkedin.com/company/al-tiqnea/",
    "overview": "Al-Tiqnea Economic Consultancy was founded in 2012, our company was established by a team of investment professionals to become one of the leading investment companies toِ provide management consulting services to local companies and international institutions. Since its inception, the company has continuously expanded to become one of the leading consulting firms in the region through its branches in the Arab world as well as representative offices in Europe.\nWe provide economic and investment consulting and financial advisory services to organizations, entrepreneurs and investors to enable them to succeed and achieve their business ambitions.\nIf you are looking to start a business, whether commercial or industrial, looking for reliable economic and financial advice, subject to scientific and field research, or looking for a sound way to start your business or expand your existing economic activity. The company offers solutions to all these questions through an economic feasibility study that includes all scientific and practical aspects to ensure the right decision about your project.\nThe company also provides advice and advice in your existing project in terms of administrative, technical and marketing restructuring to expand economic activity.\nThe company also provides a specialized management team to manage your project and identify weaknesses and strengths to ensure increased profits and avoid losses and enter the market properly."
  },
  {
    "name": "EFG EV Fintech",
    "link": "https://www.linkedin.com/company/efgevfintech/",
    "overview": "EFG EV is combining the financial know-how of EFG Hermes and entrepreneurial expertise of Egypt Ventures to launch the country’s most powerful fintech-focused startup accelerator. \nWe’re investing in rising fintech startups with the potential to grow domestically and expand beyond the Egyptian market. \nEFG EV also provides our innovators with the fully integrated services they need to thrive – from funding to mentorship, to training and office space."
  },
  {
    "name": "ElGameya",
    "link": "https://www.linkedin.com/company/elgameya/",
    "overview": "ElGameya is a FinTech mobile application that is used to organize and manage micro-savings and credit (ROSCA model).\n\n It mainly provides microcredit and collaborative lending solutions. ElGameya is based on the concept of sharing economy. We believe that ‘Sharing is Caring’.\nA ROtating Savings and Credit Association (ROSCA) is a group of individuals who agree to meet for a defined period in order to save and borrow together.\n\nA group of people deposits regular sums of money over a fixed interval with a principal individual, known as ‘the banker’.\nThe money then goes into a central fund.\nEach person in the group will take a turn in withdrawing all that money.\n\nFor example, if ten partners pay in £10 each week, over the next ten weeks each week the banker will pay £100 (the draw) to one partner.\nThis is done each week until every partner member has taken part in a draw."
  },
  {
    "name": "Finlease EG",
    "link": "https://www.linkedin.com/company/finleaseeg/",
    "overview": "FINLEASE is a growing leasing in the Egyptian leasing market as of 2019. The company has shareholders with decades of experience in the leasing market.\n\nThe company provides leasing products and services tailored to meet corporate capital expenditure needs for a wide variety of assets, which includes commercial and administrative real estate, equipment financing, plant and machinery, transportation assets, systems & IT, office equipment and fleet management."
  },
  {
    "name": "Capital Incorporation- Egypt",
    "link": "https://www.linkedin.com/company/capital-incorporation--egypt/",
    "overview": "Capital Incorporation- Egypt established to be the leader in the field of wealth creation through widening the investment scope to assist small and medium investors to maximize profits and minimize the risk. \r\n\r\nCapital Incorporation - Egypt established to provide investors with access to investment opportunities that are typically reserved for institutions and professional investors. We aim to be valued as a trusted partner in wealth creation. \r\n\r\nOur commitment to investors:\r\n\r\nAccessibility\r\n Provide access to investment opportunities that are typically reserved for institutions and professional investors, and which most investors never get the opportunity to consider.\r\n\r\nPerformance\r\n Through active investment management, Capital Incorporation aims to deliver consistent positive returns.\r\n\r\nService Excellence\r\n Being small and focused, we can communicate with, and deliver superior service to, our customers.\r\n\r\nIntegrity\r\n we are committed to transparency and fairness across our business and everyone we do business with can rely on us to operate in an honest and ethical manner."
  },
  {
    "name": "Middle East for Consultations MEC",
    "link": "https://www.linkedin.com/company/middleeastforconsultationsmec/",
    "overview": "MEC was founded in 1997, managed by a team of specialists in their fields of expertise. We provide our integrated services through more than 200 accountants, auditors and consultants.\nMEC serves more than 160 multinational, top national clients and audit projects funded by foreign grants and loans.\nThe company's activities extend to the regional area through the company's branch in Riyadh and through our correspondents in Jeddah. \nMEC’s activities extend regionally through our correspondents offices.\n"
  },
  {
    "name": "FSI-Egypt",
    "link": "https://www.linkedin.com/company/fsi-fra/",
    "overview": "معهد تدريبى تابع للهيئة العامة للرقابة المالية متخصص فى تقديم البرامج التدريبية للقطاع المالى غير المصرفى (تأمين - سوق مال - تمويل عقارى - تأجير تمويلى - تخصيم - ضمانات منقولة- تمويل متناهى الصغر .....)"
  },
  {
    "name": "Acumen Holding",
    "link": "https://www.linkedin.com/company/acumen-holding/",
    "overview": "Acumen is a fast growing investment bank that provides a wide range of financial services to a substantial and diversified client base that includes; financial institutions, government entities, retail investors and high-net-worth individuals.\r\n\r\nUpon our establishment, we set a strong platform to withhold our core values; integrity, hard work, accountability and trust. Those are the four pillars of our firm that help us provide uncompromising standards to our clients.\r\n\r\nOur executive management members are committed to delivering exceptional services. Our cumulative years of experience in the field have enriched us with a focused, well balanced strategy to better serve our clients.\r\n\r\nIn the field of investment, every day brings new challenges and opportunities, but we here at Acumen work vigorously to overcome those challenges and gear those opportunities to our clients’ advantage bringing back the best returns out of our investments mandates."
  },
  {
    "name": "Kiwe",
    "link": "https://www.linkedin.com/company/kiweapp/",
    "overview": "Financial Services"
  },
  {
    "name": "OKAZ Investments",
    "link": "https://www.linkedin.com/company/okaz-investments/",
    "overview": "Since 1984, OKAZ investments has cooperated with investors, financial institutions and governments to achieve their financial goals and to bring up their visions into reality. We are known for our experience and integrity. We offer our clients a wide range of services in Asset Management, Securities Brokerage, Research, and Online Trading through a group of experts\n\nOKAZ is an offspring of \"Mohamed Hamed Financial Advisor & Stockbroker\"​ a private firm established in 1984 by the late Dr. Mohamed Hamed, former president of the Cairo Stock Exchange, who was a renowned scholar and a credible financial advisor.\n\n\n\nDr. Hamed established an institution based on the values he cherished and honored, which are commitment to excellence, innovation and integrity. His legacy continues to thrive in OKAZ, with its top management having been tutored and coached by him for many years.\n\n\n\nAs we look to the future, we are committed to capitalize on our privileged position as a credible veteran financial firm through expanding our diversified client base of institutions and individuals on both the local and regional fronts.\n\n\n\nOur aim is to maintain long-lasting relationships with our clients through offering them top quality services and prudent investment advice that matches their respective financial needs and objectives. Our clients benefit from our strong edge in stock market trading as we bind our clients'​ interests with our own. Our strategy is to continuously build upon our previous achievements, while striving to widen the array of services provided to clients."
  },
  {
    "name": "Compass Capital",
    "link": "https://www.linkedin.com/company/compass-capital-for-financial-investments/",
    "overview": "Compass Capital is a leading private equity firm focusing on value investing. The firm’s multi-disciplinary team has a long and successful track record of generating attractive investment returns having successfully executed numerous transactions requiring capital flexibility, financial restructuring, and operational turnaround. Compass follows a disciplined investment approach that hinges on defining strategic initiatives, agile implementation of strategy, supporting talented management, and providing required growth capital to drive growth. The company is a principal investor in its own transactions and actively works to ensure that the interests of all stakeholders are aligned in the investments it pursues.\n\n"
  },
  {
    "name": "Axia Capital",
    "link": "https://www.linkedin.com/company/axia-capital/",
    "overview": "Axia Capital is a financial services firm based in Egypt providing investment banking and corporate restructuring services to major corporations and family owned businesses.\n\nServices include:\n- Mergers and acquisitions\n- Corporate finance\n- Debt and equity raising\n- Corporate advisory and restructuring\n\nFor more information please visit our website:\nwww.axiacapital-eg.com"
  },
  {
    "name": "XPay",
    "link": "https://www.linkedin.com/company/xpayeg/",
    "overview": "Financial Solutions for cashless Communities. A platform enabling cashless transformation of communities. Universities, schools, social and sport clubs, residential compounds, and activities centers benefit greatly from the efficiency and time saving of our cashless platform. "
  },
  {
    "name": "Edupay",
    "link": "https://www.linkedin.com/company/edupay-eg/",
    "overview": "Edupay is an Egyptian financial technology (Fintech) platform that aids individuals seeking loans to pay for their own or their children’s education.\n\nBy capitalizing on our business partnerships with financial firms and technical know-how, we can help applicants get an educational loan more quickly and conveniently than traditional banking services.\n\nOur service works through our proprietary mobile application. It allows users to register and apply for their desired loan amount, the number of installments, and interest rates easily through three simple steps. The registration and application processes are entirely automated by having users upload the required documents using their phone’s camera, after which the rest of the process is taken care of by our dedicated experts.\n\nBacking our fintech services is our founders’ 20+ years of collective shared experience in financial instrument trading, software development, and entrepreneurship. Our shared expertise enables us to provide a unique and more accessible market offering in Egypt’s financial services sector."
  },
  {
    "name": "CreditGO",
    "link": "https://www.linkedin.com/company/creditgo/",
    "overview": "CreditGO, a free mobile application for electronic payments that serves C and D segments' merchants located in tier 2 cities and introducing cashless payments & digitalization; thus achieving financial inclusion, create jobs and generating operating income to everyone."
  },
  {
    "name": "ABC Business Solutions",
    "link": "https://www.linkedin.com/company/abc-business-solutions1/",
    "overview": "ABC \"Company is a Leader in the field of financial and consulting services\nWe have an integrated team with a high level of experience and efficiency\nIn all fields which business owners and companies NEED IT.\n\nتقديم كل الخدمات التي تحتاجها الشركات من نافذة واحدة بمستوي عال من الكفاءة ولكن معتمدين علي تخفيض تكلفة هذة الخدمات نتيجة تقديمها بشكل متكامل من خلال شركة واحدة"
  },
  {
    "name": "PaySky, Inc.",
    "link": "https://www.linkedin.com/company/paysky/",
    "overview": "PaySky is the Next-generation Payment Solutions Provider, offering a broad range of payment solutions to financial institutions, merchants & consumers world-wide (mPOS, SmartPOS, Mobile Wallet, QR Code payments, InApp payments APIs & more), with a vision of “Democratizing e-payments” PaySky aims at availing payment solutions to everyone, everywhere to remit, pay & get paid! (www.PaySky.io)"
  },
  {
    "name": "EFG KabeelWorld",
    "link": "https://www.linkedin.com/company/efg-kabeel-world/",
    "overview": "المجموعة المالية  قابيل - EFG Kabeel World\n\n\nEFG KabeelWorld Group investment \nWe aim to give a stimulating experience to our employees & clients through our dynamic approach towards making their association fruitful. Professionalism and excellence at every single step is what we embrace at our organise at Dynamic Approach\nOur mission is to build an ever-growing and dynamic company with superior customer service, high integrity, tons of creativity and a global customer experience management. Collaboration, accountability and passion are the core qualities that we believe in.\nExcellence is Our Ultimate Aim\nOur Vision\nWe envision raising the bar of the exhibition industry by manifesting professionalism, commitment, excellence and high standard of exhibition organization. By providing exceptional experiences in business promotions, networking and discussion forums, Kabell serves as a catalyst for the tremendous growth & development of the industry. Professionalism\nOur Values\nDedication, passion, integrity and innovation are the core values of our company that have taken us this far. The attempt to evolve at every step and to serve the best with perfection has been our strength.\nCreating Success Stories\nIn Middle East & Beyond\nWe are a progressive organization that redefines brands and builds businesses by creating multiple dynamic platforms. We organize world-class exhibitions and conferences of repute not only all across Egypt but also in Lebanon,  and Dubai. We also specialize in PR business for Financial Business\nOur CEO \nPhD WaelM kabeel with more than 17 years demonstrated history of working in the financial services industry \nExperience \nSkilled in American Stock Market ,CfDs , shears indices,Forex,investment,\nbitcoin ,Gold investment \nAdvertising, CEOs, Qualifying Prospects, and Acting,Strong business development professional with a Master's degree focused in Hotel/Motel Administration/Management from Helwan University Cairo.\nPhdwaelkabeel.com"
  },
  {
    "name": "YARN For Personal Financial Planning",
    "link": "https://www.linkedin.com/company/yarn-for-personal-planning/",
    "overview": "Providing personal financial plan, children courses in planning and time management, financial planning consultants."
  },
  {
    "name": "B Investments",
    "link": "https://www.linkedin.com/company/b-investmentseg/",
    "overview": "A Leading Local Private Equity Company\n- Established in 2006, B Investments  is an Egypt-based private equity company. \n- B Investments  is an active growth capital value investor. \n- Seeks to use its wealth of expertise to actively create value in its portfolio companies.\nManaged by Prominent Management Company\n- B Investments  operates through a management contract with BPE Partners - a leading private equity manager with EGP 14 billion in investments under control. \n- B Investments  management team has more than 300 years of combined financial and operational experience– critical to value creation techniques employed. \nEvergreen Structure\n- B Investments’ evergreen structure eliminates the disadvantages of a typical fund structure– with a definite lifespan. \n- Enhanced flexibility to sell assets at the peak of their business cycle to maximize shareholder value. Ability to exit flexibly to cut losses on investments."
  },
  {
    "name": "Seena I سينا",
    "link": "https://www.linkedin.com/company/seenapay/",
    "overview": "Seena Pay is a medical installments payment solution that focuses on providing patients especially the non banking ones with the ability to pay in installments up to 12 months\n\nMedical services that are not included in the medical insurance like cosmetic ones (Derma, Dental and Bariatric surgeries) are expensive which sets a limit for the patients who cannot afford to pay for the required services in bulk but cannot afford it with an easy payment plan."
  },
  {
    "name": "VCFO consulting",
    "link": "https://www.linkedin.com/company/vcfoeg/",
    "overview": "The Virtual CFO is a new way for businesses to get CFO support that they wouldn't have been able to afford previously. Despite having an experienced financial professional at a fraction of the cost of a full-time CFO, a Virtual CFO will carry out all the duties of a traditional CFO, but work remotely and on a part-time basis.\nWe offer a selection of professional, top-quality financial services in the fields of preparing for a fund raising, developing business plans, implementing systems and processes, implementing budgeting systems, comprehensive financial health check-ups, due diligence, cash flow planning, cost management, tax planning, exit strategy, investor relations, turnaround management, and many more\nOur service offerings are priced very sharply at rapid mandate turnaround times and provide customers with exceptional qualified CFOs, financial controllers, finance directors and analysts, by leveraging on our varied and wide database of resource pool.\n\nVCFO Team has worked with different types of clients, across different industries including Retail, Technology, Education, Banking & Finance, Automotive, Pharma, Financial Services, Restaurant, Facilities Management, Private Equity, Media and Publications, Logistics, Healthcare, and many others.\n\nAn entrepreneur managing a growing business will definitely need a strategic partner to lead and manage the financial aspects of his business. Thus, VCFO provides him with all CFO’s services, except the fact that the CFO will not be a full time employee. Although our CFO may not be present on-site all the time, he/she will always be there when needed.\n\nBased on company’s size and growth stage, we provide a flexible engagement model, enabling you to increase/decrease engagement levels, through providing the opportunity of having the best CFO talent, according to your needs. Ongoing Virtual CFO retainer engagements vary between two to thirty-five hours a week."
  },
  {
    "name": "CIT VERICASH",
    "link": "https://www.linkedin.com/company/citvericash/",
    "overview": "VERICASH…Digital innovation for all\n\nVERICASH is One Platform to drive Digital Transformation and Financial Inclusion in emerging markets. Our Innovative Software Technology, supported by our connected Network of leading market stakeholders, empower a new Collaborative Ecosystem for the delivery of Digital Financial services to All customers.\n \nCIT VERICASH, the mobile payment division of CIT Global, provides an innovative software platform that enables an ecosystem of collaborative mobile financial services empowering financial inclusion in emerging markets. CIT VERICASH is building on CIT Global unique mix of expertise that is unmatched in the mobile services market. CIT Global is an international leading provider of innovative eCommerce and mCommerce software solutions and services with solid expertise spanning 25 years, since its establishment in Toronto, Canada in 1993. By applying CIT Global’s dedicated centers of excellence and its specialized leading products, in cooperation with its strategic partners, the company has delivered innovative and award-winning solutions to its clients in more than 48 countries, serving leading brands from North America, Europe, Asia Pacific, the Middle East and Africa."
  },
  {
    "name": "MCDR - Misr for Central Clearing, Depository and Registry",
    "link": "https://www.linkedin.com/company/mcdr.egypt/",
    "overview": "MCDR Company Profile\n  Misr for Central Clearing, Depository and Registry (MCDR) was established according to the provisions of the Capital Market law # 95 of 1992 and within the framework of the programs adopted by the Capital Market Authority (CMA) for developing the capital market mechanisms and applying the central depository system. This is done based on the French expertise of Paris stock Exchange and SICOVAM; a world leader in the application of the central depository system.\n\nThe Central Depository and Registry Law was issued on the 18th of May, 2000 to regulate MCDR activities, establish the relevant legal framework and add new activities to help MCDR become  a self Regulatory Organization. The activities and structure of the MCDR are regulated by a special law that grants MCDR the authorities required to undertake its functions, perform its duties and develop the services it provides to members according to the best international practices.\n• The authorized capital was set at EGP 10 million and the issued capital was set at EGP three million distributed on 30,000 shares; the value of each share is EGP 100. \n• The authorized capital was increased to EGP 15 million and the issued capital was also increased to be EGP 15 million distributed on 150,000 shares; the value of each share is EGP 100. \n• Another increase was effected on the authorized capital to  make it EGP 50 million and the issued capital is also increased to be EGP 18,750,000 distributed on 187,500 shares; with a par value of EGP 100 for each share. \n• The authorized capital was increased once more to be EGP 100 million and the issued capital was also increased to EGP 40 million distributed on 400,000 shares with a par value ofEGP 100 for each share. \n• In 2009, MCDR authorized capital was increased to EGP250 million and issued capital increased to EGP 154 million distributed on 1,540,000 shares with EGP100 par value for each share.\n"
  },
  {
    "name": "Odin Investments",
    "link": "https://www.linkedin.com/company/odin-investments/",
    "overview": "Odin Investments is an extension to the long persisting company in the Egyptian Capital market “Egyptians Abroad for Investment & Development, a company that has demonstrated its continuous urge for development & improvement over the years.\n\nThe idea behind establishing Egyptians Abroad for Investment and Development Company emerged during the first Egyptians Abroad Conference in 1981 held under the auspices of the President Mohamed Anwar El Sadat. It was further emphasized given the recommendations of the second conference in 1983, to find an effective mechanism to attract Egyptian Expats abroad to invest in projects that help prospering their homeland. \n\nThe company was established in 1984 and has contributed over the past 35 years to the establishment of several companies operating in various sectors (Industrial, Services, Real estate and Financial Sectors) and aided in the continuous development of the Egyptian Economy. \n\nOver the years, the company developed the relevant and necessary know-how in the financial services and investment sectors through M&A transactions, company establishment, real estate investments as well as financial securities and related activity\n\nThe company was granted the licenses to operate in all investment banking related activities & non-banking financial services from the Capital Market Authority back in 1997, but the decision to utilize them appropriately came earlier this year on the back of improved market conditions & board’s future plans.\n\nThe company has decided to activate the following departments starting September 2019: \n\nAssets Management\nPrivate Equity\nInvestment Banking"
  },
  {
    "name": "Sadad Egypt",
    "link": "https://www.linkedin.com/company/sadad-egypt/",
    "overview": "We are an Egyptian joint stock company specialized in providing electronic payment and collection services since 2016."
  },
  {
    "name": "Flick Remittance",
    "link": "https://www.linkedin.com/company/viaflick/",
    "overview": "Flick is the 1st Egyptian seamless peer to peer app that digitizes the cross-border end to end transfer of money."
  },
  {
    "name": "UHY United for Auditing,Tax,Advisory&Financial Services",
    "link": "https://www.linkedin.com/company/united-for-auditing-tax-advisory-financial-services/",
    "overview": "United for Auditing, Tax, Advisory and Financial Services\n(UNITED), is a multiline professional service firm designed to\noperate as one—a single global partnership united by a strong\nset of values, including a deep commitment to diversity.\nUNITED is founded by a group of partners with more than 30\nyears of professional experience in Egypt, Middle East, and\nNorth America with a vision of partnering with our clientele to\nprovide agile and practical solutions. The founding team has\nworked with the most prestigious conglomerates in Egypt and\nthe region and helped them to make better decisions, and\ndeliver sustainable results, that goes beyond financial and that\nare practically tailored to their needs\nUNITED span of services include in addition to Assurance and Tax,\ncorporate finance, services for strategy and Technology\ntransformation, as well as digital transformation, improvement\nsolutions, organization designs and governance. We believe in\nworking with our clients to provide them with tailored market entry\nstrategies, deal structuring and execution as well as lead advisory\nservices, including valuations, due diligence and mergers and\nacquisitions across industries.\nWe are committed to our clients: we want to be your partner in\nbusiness. To achieve this, we must understand you and your\nbusiness, applying our technical expertise and specialist knowledge\nthrough clear, independent, working relationships. Our ambition is\nto be your long-term trusted advisory and auditors.\nOur Values\nWe believe in demonstrating a \"one team\" attitude and are led by our full team of partners across all service lines.\nOur strategy\nOur strategy stems from focusing on and dominating the upper-tier market segment, while maintaining quality and technical superiority and creating impact solutions to drive excellence to our clients. This is achieved through our pool of experienced and outstanding professionals that can deliver starting from the conception of a project to implementation.\n\n"
  },
  {
    "name": "Zilla Capital For Investment",
    "link": "https://www.linkedin.com/company/zilla-capital-for-investments/",
    "overview": "Zilla Capital For Investment is a one stop shop, fully fledged, financial services firm offering a variety of investment services & solutions in the MENA region.\n\nContact us on: info@zillaholding.com "
  },
  {
    "name": "EgyLease  (IDB Group)",
    "link": "https://www.linkedin.com/company/egylease/",
    "overview": "EgyLease was launched in 2016 by the Industrial Development Bank (IDB). Currently EgyLease’s paid-in capital is EGP 250 million. Egylease is regulated under Law 176 of 2018 and all the laws and regulations covering the financial leasing market in Egypt.\n\nSince its inception, Egylease has been growing progressively and is striving to become one of the top and key players in the Egyptian financial leasing market"
  },
  {
    "name": "Financial Markets Academy",
    "link": "https://www.linkedin.com/company/investmenthouse/",
    "overview": "تتلخص بعض مهام الشركه فيما يلي\nتقديم توصيات وخدمات مالية احترافية لسوق الأسهم .\nدراسة سوق الأسهم المالية بصورة فنية متخصصة .\nتأمين استثمارات ومدخرات عملائها والحفاظ عليها في نموٍ دائم .\nتأمين استثمارات ومدخرات عملائها والحفاظ عليها في نموٍ دائم .\nاعطاء النصائح لإدارة المحافظ بأفضل الاساليب الفنيه و التي تضمن افضل نسب ربح مقارنة بأداء السوق ."
  },
  {
    "name": "Hollydesk",
    "link": "https://www.linkedin.com/company/hollydesk/",
    "overview": "A SaaS for SMEs that will take care of the company's daily expenses and accounts payable with one platform to replace manual tools and cover the spending process end to end."
  },
  {
    "name": "KlickIt Egypt",
    "link": "https://www.linkedin.com/company/klickitegypt/",
    "overview": "Founded in 2017 under the name of Q-Less. KlickIt is a payment management and digital collection platform aiming to digitize payment services that will provides the perfect solutions for you, your business and your customers\n\nTo date Klickit has helped digitize the financial and operational processes for many educational and sports entities through processing millions in throughput, keeping them empowered to manage their payments and closely connected to their customers"
  },
  {
    "name": "Delta Holding for Financial Investments",
    "link": "https://www.linkedin.com/company/delta-holding-for-financial-investments/",
    "overview": "Private Equity & Venture Capital targeting Small and Medium Entrepreneurial Companies"
  },
  {
    "name": "Prime FinTech",
    "link": "https://www.linkedin.com/company/primefintech/",
    "overview": "Prime FinTech is an all-encompassing NBFS institution, powered by a 360 digital ecosystem supporting its various lines of business including: leasing, factoring, and consumer finance. Our objective is to establish leadership in the market while fostering financial inclusion and encouraging a cashless society."
  },
  {
    "name": "The Middle East Angel Investment Network (MAIN)",
    "link": "https://www.linkedin.com/company/the-middle-east-angel-investment-network-main/",
    "overview": "The Middle East Angel Investment Network (MAIN) is an alliance of the leading angel investment networks across the MENA region. Together, these groups have a combined membership base of over 400 individual angel investors who regularly invest financial and intellectual capital in some of the most promising early stage companies in the region. MAIN aims to promote angel investing across the region, to facilitate the syndication and flow of deals between its members and to provide a platform for training and exchange of best practice."
  },
  {
    "name": "Leverage",
    "link": "https://www.linkedin.com/company/leveragefc/",
    "overview": "Leverage is a digitally-enabled financial services startup that provides the complete set of corporate finance services.\n\nBuilt upon the principles of Credibility, Capability & Competence, we aim to bring financial acumen and excellence to our clientele.\n"
  },
  {
    "name": "qarenly - قارنلي",
    "link": "https://www.linkedin.com/company/qarenly/",
    "overview": "We help you find better financial products for your specific needs. Whether you need a personal loan, credit card or savings account, we get you the information you need to choose better."
  },
  {
    "name": "Growxcel",
    "link": "https://www.linkedin.com/company/growxcel/",
    "overview": "Who we are?\nGrowXcel is a professional enterprise resource planning/ management consultancy firm with over 20 years of experience in the field. GrowXcel provides well-trained to help individuals or organizations make wise financial decisions by utilizing the latest market trends and stock values. GrowXcel offers superior analytical/numerical aptitude and analyzes/identifies trends using key market metrics to ensure clients receive the cost & budgeting advice they need.\n\nServices:\nSpecialized cost management services for the manufacturing, medical and F&B industries.\nCreative Solutions:\nTailored-made cost management software systems to suit your company’s needs.\n\nResults:\nHelping industries make wise financial decisions by utilizing the latest market trends and stock values.\n\nOur team includes:\n- Specialized cost accountants:\nOur accountants serve the industrial, service and food & beverage fields. They enjoy vast experience in the aforementioned fields, are proficient in using computer systems as well as accurately collect data and ensure their confidentiality.\n- Advertising staff:\nFine Arts graduates with creative talent to design trademarks and all advertising media, all while guaranteeing the best value for printing costs.\n- Quality and operational staff (F&B):\nOur quality and operational stall enjoy years of experience in developing quality systems, training teams as well as all operational details. "
  },
  {
    "name": "RK Anjel",
    "link": "https://www.linkedin.com/company/rkanjelcom/",
    "overview": "RK Anjel is a venture lending firm. Lending small businesses and startups"
  },
  {
    "name": "PayMint",
    "link": "https://www.linkedin.com/company/paymint/",
    "overview": "PayMint is a local company established in Egypt, Providing businesses with a powerful payment solution that allows them an easy cashless paymints, strong payroll management system and also provide businesses with fringe benefits for employees which makes PayMint the best solution that provides this bundle of services."
  },
  {
    "name": "YRS",
    "link": "https://www.linkedin.com/company/yrs-finance-audit-firm/",
    "overview": "We are an accounting and auditing office founded by Mr.Yousry Sadek, a certified public accountant CPA, established in 2019. We have a great experience in accounting, auditing and tax consulting. We are working by the most professional means to present the best service for our partners in their business. We have international academic background and license to work in Egypt and United States of America. YRS has public accountants and consultants who are responsible for setting the firm’s strategy and overseeing its implementation. They regularly review areas of fundamental importance to the firm, such as operational and financial performance, annual business plans and budgets, new business proposals, marketing, technology development, remuneration and risk management policies. YRS represents the clients in tax authorities and in tax disputes, help them to take the bank facility they need with the best price and conditions.  \n\n"
  },
  {
    "name": "Sky Finance",
    "link": "https://www.linkedin.com/company/sky-finance-egypt/",
    "overview": "Financial Services"
  },
  {
    "name": "Zzabbat",
    "link": "https://www.linkedin.com/company/zzabbat/",
    "overview": "أبليكيشن ظبط هو اول أبليكيشن يحتوي علي نظام محاسبة متكامل للأفراد والشركات بهدف تبسيط المعاملات والعملية المحاسبية بشكل عام عن طريق أربعة مداخل:\n\nالمدخل الأول: نظام الحاسبات والفواتير وإدارة الأعمال يحتوي علي:\nمركز للتقارير وبيانات مختصرة عن مجمل الأعمال في هيئة رسوم بيانية.\nنظام لانشاء فواتير البيع والمشتريات والمصروفات وحفظها.\nيتيح اضافة منتجات او خدمات وتسعيرها.\nيتيح اضافة الخصومات والضرائب وارسال اشعارات للدفع.\nامكانية توليد احصائيات لتتبع التكلفة والمبيعات.\n\nالمدخل الثاني: حاسبات الضرائب والقروض وفيه يتم:\nانشاء حاسبات للضرائب المختلفة حيث يمكن من خلالها إدخال الرقم ويتم توليد الضريبة ذاتيا عن طريق البرنامج.\nانشاء حاسبة للقروض المختلفة ويمكن من خلالها حساب دفعات سداد القرض و تعديل معدل الفائده والمده.\n\nالمدخل الثالث: مدخل الاستشارات\nويضم عدد 8 مداخل لمختلف الاستشارات يحتوي كل مدخل علي نموذج استفسارات للبيانات الاساسية لصاحب الاستفسار و نقاط الاستفسار في صورة (questionnaire).\n\nالمدخل الرابع: مدخل المقالات\nويضم مجموعه من المقالات المحدثه دوريا عن الحسابات والضرائب والاقتصاد بشكل عام.\nأبليكيشن ظبط بيخدم الأفراد أصحاب المشاريع الصغيرة اوالشركات الناشئة (Startups) او مجموعات الأعمال الصغيرة او الشركات المساهمة او صغار المحاسبين.\n\n.وبنوفر عليك مشوار مكاتب المحاسبة اللي مابيخلصش لأنك ببساطة مش محتاج محاسب.\n\nمع Zzabbat المحاسب في جيبك.\n\n\n"
  },
  {
    "name": "ABEX Business Solutions",
    "link": "https://www.linkedin.com/company/abex-business-solutions/",
    "overview": "We are consultants in financial solutions, Project management and executives, leadership and innovative solution.\nWe are dedicated to delivering outstanding client service, we are offering our clients more than just outstanding capabilities ,  our Experts team has a good experience in a different financial and operational areas ."
  },
  {
    "name": "EPL HOUSE",
    "link": "https://www.linkedin.com/company/epl-house/",
    "overview": "EPL HOUSE is specialized in financial, core banking and integrated mobile solutions. Our team is experienced in the fields of investment, financial, equity and banking management.\nOur global partnerships are strategically aligned to satisfy your broad and specific fintech needs, and drive your innovation onward."
  },
  {
    "name": "Bedaya Mortgage Finance Co.",
    "link": "https://www.linkedin.com/company/bedaya-mortgage-finance-co/",
    "overview": "Bedaya Mortgage Finance was founded by TMG in 2007 and it is licensed under the Egyptian Financial Regulatory Authority (FRA). In 2019 a joint venture was established equally between TMG, Egypt's leading developer of premium master planned communities, GB Capital (the NBFI arm of GB Auto) and EFG Hermes Finance (the NBFI arm of EFG Hermes Holding) with a paid-in capital of EGP 150 million and changed the name of the company from Al Tayseer to Bedaya."
  },
  {
    "name": "Reanda SMC",
    "link": "https://www.linkedin.com/company/safwat-nour-el-din-management-consultants-smc-member-of-kreston-international/",
    "overview": "In our permanent pursuit of excellence and to establish and achieve an integrated consulting service at the highest level, Safwat Nour El Din Management Consultant ” SMC” was established in 1982 to meet the various  investor’s requirements in the field of financial, economical, investment, administrative, financing and legal consultancy as well as providing integrated solutions for accounting, taxation, insurance, and governance.\n\nWe are committed to apply the highest quality control standards with experience, confidentiality, and objectivity, depending on three main factors:\n\nComprehensive Services\nAccuracy and diligence in the performance of the business with a commitment to the timeframe\nOur commitment to providing the highest level of services\nSMC provides its services through separate and independent departments, and each department operates under the supervision and management of a specialist partner in his field accompanied by work group of specialists for optimum results.\n\nInternational alliances\n\nSMC as a founder of IFAB join Kreston International, England; one of the largest worldwide association of independent accountancy and advisory firms; currently ranking as the 12th largest accounting associations in the world, represented in over 100 countries where member firms work as one team to provide the highest quality available in their respective country. After many fruitful years with IFAB and Kreston our journey came to an end.\n\nIn 2018 SMC joined Reanda International a rising star between international accounting networks. Reanda International is one of Asia’s leading networks and Reanda International, as the first China branded international accounting network to collaborate with independent member firms from overseas countries and regions. Reanda International was ranked 20th amongst the international accounting network. Currently, Reanda International is represented by 30 network firms with more than 120 offices and 3000 professionals..\n\n "
  },
  {
    "name": "Wall Corporation",
    "link": "https://www.linkedin.com/company/wall-corporation/",
    "overview": "Wall Corporation is a financial services and investments company that takes you to Wall Street, actually literally. We grow businesses by introducing unique investment methods.\r\n\r\nWe believe our everyday life can be improved with very tiny touches that shouldn’t cost us much. We believe our cities can be easily made better, more convenient and fancy enough without being too costly.\r\n\r\nWe also believe everybody is an investor, in a way. It doesn’t take a fortune to be an investor. We help you start today. We financially coach and connect people to the right companies for them to invest in.\r\n\r\nWe provide companies with fast and simple funding to finance their opportunities by selling their stocks relying on our huge network. We also become their financial coaches.\r\nWe operate mainly in Egypt with a global presence. Our headquarters is in New Cairo and our first global office will be in 14 Wall Street, New York, NY."
  },
  {
    "name": "World Vest Base",
    "link": "https://www.linkedin.com/company/world'vest-base/",
    "overview": "World′Vest Base (WVB) is a relational database of financial, statistical and market information on active and inactive  global  companies.  The  database  provides a broad  range of  informational  products  directed at institutional investors, universities, bankers, analysts, tax and audit practitioners, government agencies and asset managers in corporate, M&A, private capital, equity and fixed income markets. \nThe database  covers  currently a universe of more then 55,000 active listed companies and over  49,000  inactive companies. This covers approximately 99% of all listed companies and a total worldwide market capitalization of close to 100%. \nCompany history is available back to 1984 and quarterly data is available depending on when the company was added to the database."
  },
  {
    "name": "LSB - Egyptian Stock Exchange",
    "link": "https://www.linkedin.com/company/lsb---egyptian-stock-exchange/",
    "overview": "www"
  },
  {
    "name": "Lnddo",
    "link": "https://www.linkedin.com/company/lnddo/",
    "overview": "LNDDO is the pioneer of digital lending for SMEs in MENA. The company leverages technology and big data analytics to deliver innovative credit products to businesses across the region with a current focus on the UAE, Egypt and KSA.\n\nThrough its proprietary digital loan underwriting and origination technology platform, it is delivering financing solutions to vast sections of the economy underserved by traditional financial institutions. It is developing partnerships to fund working capital for SMEs through ecosystem partners such as payment gateways, e-commerce, large manufacturing supply chain corporates and F&B Manufacturers."
  },
  {
    "name": "Royal M.G Securities",
    "link": "https://www.linkedin.com/company/royal-securities/",
    "overview": "رويال لتداول الاوراق المالية ش.م.م حاصلة على ترخيص مزاولة النشاط من الهيئة العامة للرقابة المالية برقم (642)"
  },
  {
    "name": "HYKALA FMC",
    "link": "https://www.linkedin.com/company/hykala-fmc/",
    "overview": "HYKALA has a resource of highly experienced consultants and professionals who offer a wide array of top quality business partnership services to corporates in the MENA region. Supported by its partners'​ solid experience we guarantee to serve you with a strong commitment to quality of service.\n\nThrough our financing solution models, We chose to be partners in success, allowing our clients to have insight over the competitive advantage of better decision making, the right way of implementation and better resources allocation.\n\nWe support the whole business to raise standards in the decision-making process, supported by a toolkit of rich consulting experience."
  },
  {
    "name": "OEX - Outsourcing Experts",
    "link": "https://www.linkedin.com/company/oex-outsourcing-experts/",
    "overview": "OEX was established to provide organizations with Business Process Outsourcing (BPO) services that aim to drive long-term cost reductions while focusing on performance improvement.\nWe think of outsourcing as a partnership not just a service and it is with this notion in mind that we have structured our organization, processes and technological platform. OEX uses the latest in IT development to deliver it's services in an efficient and timely manner.\nOEX fully understands its client's needs to achieve their goals efficiently and effectively. Simply we are your business partner not just a service provider.\nOEX is independent. This means we are free to work with your existing auditors, advisors or banks without worrying about corporate governance or local regulator restrictions."
  },
  {
    "name": "SKY Lease",
    "link": "https://www.linkedin.com/company/sky-lease-egypt/",
    "overview": "NON"
  },
  {
    "name": "OAF",
    "link": "https://www.linkedin.com/company/oaf-egypt/",
    "overview": "* OAF, which was formally established in 2003, is an Egyptian Auditing Firm engaged in providing auditing, taxes and Consulting services. OAF employs a group of highly qualified and experienced professionals to perform these tasks in an efficient way that differentiate its customers from their competitors inside the Egyptian Market. Moreover, OAF is a member in the Egypt Tax Society. \n\n* In 2003, Mansour Etman for Auditing and accounting started its work, The office has been known widely for the efficiency, commitment, and its ability on fulfilling its customers’ needs in a distinctive way. \n\n* In 2014, Mansour Etman office was merged with Oriental Auditing Firm “OAF” as a single entity called “OAF & Mansour Etman and his partners” aiming at providing the best Auditing, Taxes, and Consulting services. OAF employs a group of highly qualified and experienced professionals to perform these tasks in so efficient way that differentiates its customers from their competitors inside the Egyptian Market. \n\nOur Vision: \n==========\nWe enjoy an eminent market positions thanks to our principles, efficiency, and diversity. Our vision is that we yearn to become the Standard of Excellence; this can be achieved as being the most highly respected and trusted entity among the large community of customers, and to become the first choice as being the most prominent talent.\n\nOur Values: \n===========\n- Integrity\n- Sense of responsibility\n- Values and Principles Respecting\n- Continuity\n- Independence\n- Excellence"
  },
  {
    "name": "المستقبل الاقتصادي",
    "link": "https://www.linkedin.com/company/%D8%A7%D9%84%D9%85%D8%B3%D8%AA%D9%82%D8%A8%D9%84-%D8%A7%D9%84%D8%A7%D9%82%D8%AA%D8%B5%D8%A7%D8%AF%D9%8A/",
    "overview": "Financial services website"
  },
  {
    "name": "AF Securities",
    "link": "https://www.linkedin.com/company/af-securities/",
    "overview": "AF Securities aims to transform the dialogue surrounding Egypt’s stock market, allowing it to become more inclusive and easier to navigate. \n\nThrough our technology and well-trained staff, we aim to tailor our services to meet every need of both the novice trader and the well-rounded investor. \n\nOur Story\n\nFormerly Arab Finance Financial Services, the company was launched in 2001 as a stock-market information portal, and in 2008 Arab Finance added a brokerage to its line of business.\n\nSince then, the company has witnessed several ownerships ain its journey, the latest of which was in March 2018 where the company was acquired by new management with an eye for a complete growth-focused revamp. The first step of which is the separation of both lines of business to enhance the value delivered. \n\n"
  },
  {
    "name": "BeeMobileEG",
    "link": "https://www.linkedin.com/company/beemobileeg/",
    "overview": "“Bee Mobile” is your easy mobile payment tool that you can recharge and use it at any time to pay a lot of services in Egypt. You can get mobile credit, pay your mobile, internet landline, electricity and more other bills in few seconds from the mobile payment feature in the app. Bee Mobile accepts VISA® and MasterCard® credit and debit cards. Through using a single mobile application you can pay various services using multiple credit/debit cards from different banks, you no longer required to hassle between payments and keeping track of receipts and payments due.\n\nAlso the app has the locator function to locate your nearest Bee Smart payment solutions outlet for you using your location on map and redirecting you.\n\nDo you remember this day when you had a very important stuff to do and the internet decided to stop working because you forgot to pay your bill? And do you remember when you were setting with friends and family, and really wanted to go to the cinema but you canceled the whole idea because you were afraid not to catch a good seat by going late from the traffic?\n\nThese days are over with the Bee Mobile payment app, all you need to do is to make sure you have credit in your account to pay anytime from your mobile any service you wish!\n\niOS: https://itunes.apple.com/eg/app/bee-mobile-eg/id1208463077\nAndoid: https://play.google.com/store/apps/details?id=sg.technobiz.beemobile\n"
  },
  {
    "name": "AcumenHolding",
    "link": "https://www.linkedin.com/company/acumenholding/",
    "overview": "Acumen is a fast growing investment bank that provides a wide range of financial services to a substantial and diversified client base that includes; financial institutions, government entities, retail investors and high-net-worth individuals.\n\n\n\nUpon our establishment, we set a strong platform to withhold our core values; integrity, hard work, accountability and trust. Those are the four pillars of our firm that help us provide uncompromising standards to our clients.\n\n\n\nOur executive management members are committed to delivering exceptional services. Our cumulative years of experience in the field have enriched us with a focused, well balanced strategy to better serve our clients.\n\n\n\nIn the field of investment, every day brings new challenges and opportunities, but we here at Acumen work vigorously to overcome those challenges and gear those opportunities to our clients’ advantage bringing back the best returns out of our investments mandates."
  },
  {
    "name": "Andalucia Financial Consultancy and Investment",
    "link": "https://www.linkedin.com/company/andalucia-financial-consultancy-and-investment/",
    "overview": "* Investment Management: Managing investments of medium and high net worth individuals and small and medium enterprises in the local Egyptian stock market as well as the U.S. futures exchanges covering commodities, currencies, bonds and stock index futures.\r\nWe use a unique approach of value investment that draws from fundamental and technical analysis approaches to maximize investment returns.\r\nWe hold the great record of finishing 2008 in positive territory (+10% on average) for all clients who opened accounts before April 2008. To check out our results and sample portfolios please click: here: (http://www.andaluciafinancial.com/serv_case2.html)\r\n\r\n* Financial Consultancy: We provide broad financial and strategic consultancy for individuals and firms of all sizes. From sustainable development projects to industry and sector analysis to individuals financial planning to investment evaluation and referral services. If it has to do with investment and finance and Egypt, Andalucia Financial Consultancy and Investment is your trusted partner for success. Our latest consultancy service was provided for Acumen Fund a US$ 40 million global non-profit venture fund (www.acumenfund.org)"
  },
  {
    "name": "Noqood",
    "link": "https://www.linkedin.com/company/noqoodeg/",
    "overview": "Noqood LLC is a financial platform that was established in November 2017. The company offers services in the form of a mobile application which was launched at the end of May. Noqood aims to provide its users with solid information about different Egyptian financial market products and services – Banks and Stock Market - so as to help them learn and compare between these products and services and hence take the best financial decision with minimal effort. Users can also apply in the brokerage firm that suits them best through the application.\n\n\n"
  },
  {
    "name": "Amwal AlKhaleej",
    "link": "https://www.linkedin.com/company/amwal-alkhaleej/",
    "overview": "Amwal AlKhaleej is a leading private equity firm in the Middle East & North Africa (MENA) regions. With a powerful blend of indigenous and global expertise, Amwal AlKhaleej builds unique investment partnerships that deliver an Absolute Advantage to all stakeholders.\r\n\r\nWe focus on delivering superior results that are consistent, absolute, and out-perform the market. We emphasize ethics and transparency as we unlock long-term value in our investments, and our reward is a growing set of high value relationships. While open to opportunities across the region, Amwal AlKhaleej zones in on sectors where it can create value, and form partnerships with regional companies that have strong, committed management teams pursing growth.\r\n\r\nFounded in 2004 in Riyadh, Amwal AlKhaleej has offices in Dubai and Cairo. Its founders and management team include well-known merchant names and investment professionals in the MENA region."
  },
  {
    "name": "Capital Finance Consultancy Services",
    "link": "https://www.linkedin.com/company/capital-finance-consultancy-services/",
    "overview": "الشركه المصريه الاولى فى مصر لللاستشارات الماليه للشركات حيث تعد كابيتال فاينانس للاستشارات\n( التمويليه – والتسويقيه – المحاسبيه – الاداريه ) إحدى الشركات الرائدة فى مجال الاستشارات المالية والبنكيه وخدمات الإدارة الإستثمارية . وتتمتع الشركة بخبرة واسعة فى جذب وتوفير الموارد المالية وإتاحة الكوادر البشرية الماهرة لمساعدة الشركات , تعمل – كابيتال فاينانس للاستشارات – على تقـديـم مجمـوعـة متنـوعـة مـن الخـدمـات المـاليـة والائتمـانيـة للشـركـات المصـريـة الصغيـرة والمتـوسطـة علـى حـد سـواء حيـث لـدينـا أفضــل الاستشــارييـن , لتمثيـلكـم عنـد \nالتعـامـل مـع جميـع أنـواع المؤسسـات المـاليـة ( بنـوك تجـاريـة – بنـوك إسـلاميـة – شـركـات تـأجيـر تمـويـلـي – شركات تخصيم – تمويل عقارى )\n\n\nاسرع برنامج تمويلي لاصحاب الشركات والمصانع جميع القطاعات الصغيره والمتوسطه من شركة #كابيتال_فاينانس للاستشارات الماليه وادارة المشروعات بفائده بسيطه متناقصه 5 % صناعى - زراعي - خدمي\n\nتمويل موردين\nتمويل عقود - اوامر توريد - فواتير\nخطوط انتاج ومعدات\nتمويل سريع\nاقساط تناسب احتياجاتك\nمبادرة المركزى 5% - 7%\nاقل مصروفات اداريه\nجميع المحافظات والقطاعات للشركات\n\nاتصل بنا الان 01288210294\n\nwww.capitalfinance-eg.com\n\n#كابيتال_للاستشارات #تأجير_تمويلي #تمويل_شركات #مبادرة_المركزي #استشارات_ماليه #كابيتال_فاينانس_للاستشارات #تمويل_بنكي #مبادرة_المركزي #مشروعات_صغيره_ومتوسطه\n#تأجير_تمويلي #تخصيم_شيكات\n#تمويل_مباشر"
  },
  {
    "name": "Investment Funding - منصة إنفستمنت فاندينج",
    "link": "https://www.linkedin.com/company/investment-funding/",
    "overview": "If you are an entrepreneur and looking for financing without complications and easy procedures, Investment Funding platform provides you with the appropriate financing solutions, without any obstacles, by providing a group of investors to cover your need for financing.\n\nAnd if you are an investor or a person who has cash liquidity starting from 60 US dollars, and looking for safe and profitable investment opportunities, close to you in your country or in any Arab country, we filter, evaluate and calibrate investment opportunities before they are presented on Investment Funding platform, That is, you will not find profitable and safe investment opportunities except on the Investment Funding platform, not only thanks to our policy and conditions, but also thanks to our expertise and our fast-growing achievements over short periods.\n\nInvestment Funding platform is considered to be one of the first platforms for crowdfunding and Crowd-Investment in the Middle East, where we have been in the field for almost 16 years, and we are moving at a steady pace to achieve the goals of both entrepreneurs and investors over the period of our work in the field of investment and crowdfunding, and the first platform that works fully with Online investment and crowdfunding mechanism.\n\n#finance\n#investment\n#Investment_opportunities\n\nwww.investmentfunding.com"
  },
  {
    "name": "Genify.ai",
    "link": "https://www.linkedin.com/company/genify/",
    "overview": "Genify engineers AI solutions that harness financial data to sublimate user experience."
  },
  {
    "name": "Bankative",
    "link": "https://www.linkedin.com/company/bankative/",
    "overview": "Bankative lets you compare financial and insurance products and apply for the best product which fits your needs.\nOur vision was to create a highly transparent marketplace, empowering Egypt consumers to make the right choice by bringing them all the latest details to compare in one place."
  },
  {
    "name": "HHKK",
    "link": "https://www.linkedin.com/company/hhkk/",
    "overview": "At first, we would like to thank you for visiting our group and getting acquainted services provided by hany hany khalid khalid group   \r\n(Certified public accountant, tax expert, banking &financial consultancy, settlement of bad debts, feasibility studies and mortgage.)\r\n\r\n1-Establishing the account book, and preparing financial statements.\r\n\r\n2-Solving all problems, which are related to general tax on income or sales taxes and all other types of taxes.\r\n3-Settlement of bad debts through providing more than 25 years of experience in banking field.\r\n4-Helping in solving the housing problem through the mortgage finance program as we consider one of the general administrations of real estate financing brokers.\r\n5-Provide financial and banking consultations through preparing the economical feasibility studies and what is related from banking and financial analysis."
  },
  {
    "name": "VPay",
    "link": "https://www.linkedin.com/company/getvpay/",
    "overview": "All on your device | One Seamless & Touchless Experience  \nSimplifying money exchange, collections, transferees, and making it one place with secureness, seamless and touchless experiences on all platforms and devices. \n\n\n\nVPay is a digital electronic multi-use solutions payment portal that simplifies the value exchange and enables consumers, businesses, and corporates a safer, easier way to pay and get paid in-store, offline, and online and through simplifying the money exchange, transfer and make it in one place. "
  },
  {
    "name": "Vision Consulting Group",
    "link": "https://www.linkedin.com/company/vision-consulting-group-eg/",
    "overview": "• We are a group of Professional Experts at Accounting, Tax, Audit Business\nConsulting & Legal services.\n• We have acquired wide range of experience through serving significant\nnumber of multi-national and national clients in wide range of Industries’\nSegments.\n• We will help you Do More with Less Cost, effort and time through a robust\nWorkflow Automation solution.\n• We offer Business Consulting Services (Non-conventional Services) in\nspecialized areas such as International Taxes, Transfer Pricing, M&A, Corporate\nFinance in addition to the spectrum of e-payments and consumer finance,\nSpecific product expertise including credit, debit, prepaid, commercial cards,\nmerchant acquiring including new solutions like SMEs, Fleet and B2B (supply\nchain) and many more.\n• We are able to provide your organisation with information, resources, fresh\nideas, consulting as well as data analytics.\n\nVCG is a an exclusive member firm of Allinial GlobalTM, a top 10 Worldwide\nAssociation of Accounting Firms with more than 300 Offices in more than 100\nCountries in the 5 Continents."
  },
  {
    "name": "Alfa Business Consultancy",
    "link": "https://www.linkedin.com/company/alfa-business-consultancy/",
    "overview": "Alfa Business Consultancy help the individuals develop the thinking skills necessary to be effective, competitive and relevant in the current economy. They help organizations define problems, recognize opportunities, and develop new products and services by finding out-of-the-box solutions to produce innovation. Like never before, companies are recognizing that innovative thinking is a requirement for success in the emerging world economy.\r\n\r\nThe consultancy often provide a combination of project consulting and training to client companies and organizations.\r\n\r\nProject consulting involves facilitating task groups organized to address a particular problem or opportunity a company would like to focus on. Training involves presenting workshops to develop creativity in the participating employees."
  },
  {
    "name": "Egyptian Collateral Registry ECR",
    "link": "https://www.linkedin.com/company/egyptian-collateral-registry/",
    "overview": "The Egyptian Collateral Registry. allows members to pledges their rights over moveable assets granted to their customers."
  },
  {
    "name": "Aton Pharos Asset Management",
    "link": "https://www.linkedin.com/company/aton-pharos-asset-management/",
    "overview": "ATON PHAROS ASSET MANAGEMENT:\nPharos Asset Management offers tailored portfolios and structured fund products, catering to high-net-worth individuals and financial institutions, targeting risk-adjusted returns.\n-Portfolio Management\nOffering unique financial solutions through innovative investment strategies.\n-Pharos Fund I\nAn open-ended equity fund, issued in July 2009, seeking long-term appreciation of capital. While the major focus of the Pharos Fund is Egypt, up to 20% of its investments exposure is in MENA region markets."
  },
  {
    "name": "Xinvest Forex Trading Company",
    "link": "https://www.linkedin.com/company/xinvestforex/",
    "overview": "\nتأسست الشركة فى 2017 بتوكيل من شركة XM لمساعدة المتداولين في مجال الفوركس وتغيير المفاهيم الخاطئه الراسخه فى عقول المتداولين من خلال رؤية الشركه \n​\nتقليل الخسائر \nوهو يعتبر من اهم سياسات شركة Xinvest التى سوف نساعد فيها المتداولين بنظام الـ Low risk و ادارة رأس المال لتحقيق المكاسب المطلوبة فى سوق الفوركس\n​\nالفيتو \nهو يعتبر احد اهم السياسات التى سوف نطلقها فى فى السوق ومن خلالها سوف نعرض مشاكل عديده يواجها المتداول فى مجال الفوركس ونعرض حلها وكيفية التغلب عليها."
  },
  {
    "name": "WSFA-Wael Samir Financial Advisory",
    "link": "https://www.linkedin.com/company/wsfa/",
    "overview": "We are a committed Business consultancy and training organization founded in 2020 to provide our clients with high quality services that enable them to achieve their strategic and operational objectives."
  },
  {
    "name": "/BeeAgents",
    "link": "https://www.linkedin.com/company/-beeagents/",
    "overview": "TBE for Payment Solutions and Services S.A.E. working under brand name “Bee” has now launched in Egypt. It will be acting as the Middle East hub for Technobiz Equipment PTL LTD - the multinational payment solution provider that has successful business recognition in Asia and Europe.\n\nBee specializes in providing fast, easy and reliable payment solutions for a multitude of services. We offer the public the ability to pay various Service Providers anywhere, anytime in a simple process that takes only a few seconds!\n\nBee offers you a unique ‘one-window, one-stop’ means to pay different services of mobile operators, internet providers and others. To do this we use the “Cash Collector” global platform, as developed by the highly experienced, creative and professional R&D Team at Technobiz Equipment.\n\nOur edge comes from our singular, global experience in the payment solutions industry. This experience allows us to address specific payment problems and to offer tailored and convenient solutions to any Service Provider at any scale of business. We are proud to share our confidence in our work with clients including 16 mobile operators, 15 internet service providers and 7 banks, who trust us and our platform to help them serve 60 million active subscribers globally."
  },
  {
    "name": "Stride",
    "link": "https://www.linkedin.com/company/stride-co/",
    "overview": "As a financial and strategy advisor with a focus on startups and\ncompanies with high growth potential, Stride empowers leadership teams\nwith the knowledge, frameworks and accountability necessary to achieve\ntheir audacious goals."
  },
  {
    "name": "FINCALS",
    "link": "https://www.linkedin.com/company/fincals/",
    "overview": "FINCALS is a fully-fledged software service designed to bring accuracy and transparency to your income taxes. Our automated approach helps eliminate any fiscal burdens and human errors, delivering detailed reports. Our sophisticated product integrates the latest government tax reforms and regulations to help prepare you file your payroll dues. \n\nSimple. Automated. Efficient. \nTaxes made easy!"
  },
  {
    "name": "LEO-Consult",
    "link": "https://www.linkedin.com/company/leo-consult/",
    "overview": "LEO – Consult specializes in helping companies Execute Business Growth and Transformation . We offer the following services to help companies take their business to the next level:\n\n- Debt Raising and Financial Advisory: Financial re engineering and debt raising through wide access to a network of both Local and International bank and alternate debt sources.\n\n- Strategic Profit Improvement: Crafting of organic and inorganic growth and investment strategy and plans.\n\n- International Expansion: supporting both Egyptian companies expand outside Egypt and foreign companies expand into Egypt through a network of investors and business partners.\n\nBy applying deep analytics, creative strategic thinking and tapping on a diverse network of lenders, business partners and investors,  LEO - Consult helps its clients identify and execute the optimal strategy to grow and turnaround their businesses.\n\nLEO – Consult brings together:\n\n- USD 18bn in local and international debt and equity arrangements,\n\n- Over 50 years of cumulative experience in Egypt, the US, GCC and wider MENA, \n\n- Access to a local and international network of banking, alternate debt sources of finance business partners and investors,\n\n- Experience across many diverse industries including Energy, Healthcare, Contracting, Telecom, Steel, White Goods  Automotive,\n\n- Proven track record in leading Business Strategy, Planning and Execution, aggressive business growth, Business Transformation and De- risking.\n\nContact@leo-consult.com\n\nhttp://linkedin.com/in/mona-el-sayed-003aa2103"
  },
  {
    "name": "Tatweer Consultancy",
    "link": "https://www.linkedin.com/company/tatweer-consultancy/",
    "overview": "تقوم إدارة الحلول المالية بمساعدة الشركات التجارية والصناعية في إيجاد حلول تمويلية مناسبة لها من خلال تقديم الاستشارات المالية والإدارية المختلفة، سواء لحل الأزمات المالية التي تمر بها الشركة، أو لتطوير وتوسع نطاق العمل الخاص بها، ويتم ذلك من خلال مساعدتهم في الحصول على التمويل اللازم لتلبية احتياجاتهم المالية من خلال تقديم استشارات التمويل البنكية المتخصصة التي تقدمها الشركة، وتقديم المساندة المستمرة لشركائها لمساعدتهم في سداد التمويلات والقروض الممنوحة لهم، وتأهيلهم لتسهيلات مالية أكبر."
  },
  {
    "name": "HLK & Associates",
    "link": "https://www.linkedin.com/company/hlk-associates/",
    "overview": "HLK & Associates is a Chartered Accountants firm established by a team of energetic professionals, having its headquarters in Cairo Egypt and allies PROJECTA in Cairo & ATREAS in Paris France.\nHLK has a competitive resource pool of CPA's ,MBA's , IT professionals and audit subject matter experts, which enables to provide comprehensive services beyond the traditional way of auditing and consulting.\nEach mission is performed professionally for the sole purpose of adding value to the client's business, processes, and systems. \nThe regular training programs (in and outside house scheduled training programs) keep the quality level of the workforce up to date with related changes in laws, regulations and various business synonyms. \nOur passion is to create value in our profession. We present credentials of working on various challenging professionals with a competitive edge from SME’s to large entities executing both domestic and overseas projects is a testimonial of HLK & Associates' professional capabilities to execute all sorts of professional missions in its area of expertise.\n"
  },
  {
    "name": "Osoul Arabia for Investment and Financial Consultancy",
    "link": "https://www.linkedin.com/company/osoul-arabia/",
    "overview": "Osoul Arabia Financial Consultants & Securities was established in October 2007 in response to those economic developments. Osoul Arabia is an Egyptian joint stock company in accordance with the provisions of the Capital Market Law no. 95 for the year 1992 and its license issue No. 469 as 16th of June 2008 , registered under No.14, NILEX authorized sponsors enrollment as 16th of October 2008 and financial advisors register under No.1727 as 19th of  Jan. 2009. \r\n\r\n. Osoul Arabia has selective financial, economic, technical and legal expert consultants with appropriate experience where they provide advice and technical support in various sectors and fields as per rules and regulations approved by Capital Market Authority to ensure the integrated high quality and accuracy financial and economic consultants.\r\n\r\nOsoul Arabia is considered a new motivation to the Egyptian Capital Market where it contributes in the growth and development of the financial and economic sectors. As it seeks to prove its ability to promote outstanding global levels as a result of preserving a degree of professionalism, commitment and transparency in order to protect the market and maintain the success achieved by the Ministry of Investment represented in Capital Market Authority, Cairo and Alexandria Stock Exchange."
  },
  {
    "name": "Advice FX",
    "link": "https://www.linkedin.com/company/advice-fx/",
    "overview": "Advice FX is a specialized company in giving trusted and accurate advice in Global financial markets.\r\n\r\nAdvice FX was launched on the 1st of June 2013.\r\n\r\nAdvice FX is located in the luxurious Nile Twin Towers.\r\n\r\nAdvice FX Advice FX Advice FX Advice FX Advice FX Advice FX."
  },
  {
    "name": "FBS Training Academy",
    "link": "https://www.linkedin.com/company/fbs-training-academy/",
    "overview": "FBS Training Academy is considered one of the best training centers, that focuses on building new investments and trading opportunities, specially between the youth, therefore we provide courses that aims to train you on modern financial markets techniques and strategies so that investors and traders – either beginners or professionals - can find suitable solutions. \n\nإن FBS Training Academy يعتبر من أفضل المراكز المهتمة بخلق فرص جديدة للاستثمار والتداول وخصوصا بين الشباب في مصر، لذلك نقوم بتقديم كورسات هدفها التدريب على أحدث تقنيات، وآخر استراتيجيات التداول في أسواق المال؛ حيث يجد المتداولون ما يناسبهم سواء كانوا محترفين أو مبتدئين.\n"
  },
  {
    "name": "FX General",
    "link": "https://www.linkedin.com/company/fx-general/",
    "overview": "our target is to serve the professional trader and the new trader also via our services "
  },
  {
    "name": "Finance Express",
    "link": "https://www.linkedin.com/company/finance-express-official/",
    "overview": "\nFinance Express is an Educational Organization which aim to help university students and undergraduates to develop their skills in Finance through providing a Financial Modeling & Valuation courses \n\n"
  },
  {
    "name": "MuslimPay - Initiative",
    "link": "https://www.linkedin.com/company/muslimpay/",
    "overview": "We at MuslimPay think to make all Muslims around the world have their own digital payment method to dominate all their Islamic payments and to be the prefered payment tool for all Islamic online and offline sellers and service provider globally.\nFor that we think MuslimPay with its global vision and huge market target must be introduced as initiative to the Fintech ecosystem to have the most involving of different contributions such as ideas, plans, investment, regulations and visions.\nWe're here invite all Islamic Fintech interested throughout the world to share MuslimPay community to bring it life."
  },
  {
    "name": "adavio",
    "link": "https://www.linkedin.com/company/adaviotech/",
    "overview": "building fintech-enabled products\n"
  },
  {
    "name": "forexarby.com",
    "link": "https://www.linkedin.com/company/forex3araby-com/",
    "overview": "https://forexarby.com/"
  },
  {
    "name": "Zagel Consulting",
    "link": "https://www.linkedin.com/company/zagelconsultingegypt/",
    "overview": "تركز Zagel_Consulting على دعم مشروعك أو عملك الخاص في طرق متعددة, حيثما كان حجم مشروعك الخاص صغير أو متوسط أو كبير, يقوم فريق زاجل بكل بساطة بتحديد وضعك بطريقة تناسب حجم الأعمال والقدرات المالية مما يسمح لك بالنمو فى عملك بشكل مستدام .\nتٌعد زاجل ZAGEL FINANCIAL ADVISORS الشريك الأمثل في تقديم كافة خدمات الإستشارات المالية , حيث يتم تصميم خدماتنا بحيث تكون سهلة وهادفة لعملائها مدعومة ببنية تحتية شاملة في المحاسبة ، والقانون ، والامتثال ، والعمليات العالمية ، والتسويق ، وعلاقات المستثمرين ، وتكنولوجيا المعلومات."
  },
  {
    "name": "U.S Financial Advisory & Audit Firm - USFAAF -المكتب الامريكي للاستشارات المالية",
    "link": "https://www.linkedin.com/company/usfaaf-us/",
    "overview": "USFAAF’s global expansion brings new international standards to its clients in the Middle East. USFAAF has quickly become the leader when it comes to  Financial litigation, FATCA and US Taxes for American Expats, Financial Advisory and Audit."
  },
  {
    "name": "..",
    "link": "https://www.linkedin.com/company/cairo-investment-expo/",
    "overview": " middle east.\nThe EFG Kabell World Financial Group plans this year to establish the largest and most important economic EXPO in Egypt and the middle east for the Third year in a row"
  },
  {
    "name": "Tegarti",
    "link": "https://www.linkedin.com/company/tegarti/",
    "overview": "Tegarti is a cloud-based POS and omnichannel Retail Management System."
  },
  {
    "name": "FX-brokers",
    "link": "https://www.linkedin.com/company/fx-brokers/",
    "overview": "FX-brokers is a financial services company based out of Egypt."
  },
  {
    "name": "Alpha Square Partners",
    "link": "https://www.linkedin.com/company/alpha-square/",
    "overview": "Alpha Square Partners was established in 2018 to partner with successful family businesses and mid-sized companies and prepare them for the inflow of institutional & public capital. We help promoters to capitalize on the two sources of Alpha returns; quickly build scale through organic expansion, mergers & acquisitions and operational efficiencies, while achieving higher valuation multiples through adopting best-in-class governance frameworks, hiring professional management teams and upgrading the company's public profile.\nWe compliment the entrepreneurial and operational skill set of promoters with the Private Equity process discipline in scaling up businesses to ensure consistently higher returns for all stakeholders at lower risk levels.     \n"
  },
  {
    "name": "Beacon FinConsult",
    "link": "https://www.linkedin.com/company/beacon-finconsult/",
    "overview": "Powerful Solutions for Predictive Performance \nRefining Financial Consultancy for Treasury and Credit in Egypt"
  },
  {
    "name": "ركويزا للاستشارات المالية",
    "link": "https://www.linkedin.com/company/riqueza-financial/",
    "overview": "إحدى الشركات الرائدة والمتخصصة في تقديم خدمات الاستشارات المالية عن الأوراق.  تعمل بموجب ترخيص رقم (521) بتاريخ 3/4/2009 للاستشارات المالية عن الأوراق المالية من الهيئة العامة للرقابة المالية.  · قيدت شركة ركويزا للاستشارات المالية عن الأوراق المالية (الدولية سابقاً) بسجل المستشارين المالية المستقلين بالهيئة العامة للرقابة المالية تحت رقم (1732) تاريخ 18/9/2009 · قيدت شركة ركويزا للاستشارات المالية بسجل الرعاة المعتمدين بالبورصة بقرار من مجلس إدارة الهيئة العامة للرقابة المالية رقم 83 لسنة 2011 وقرار رقم 168 "
  },
  {
    "name": "EMIC Projects Development",
    "link": "https://www.linkedin.com/company/emic-projdev/",
    "overview": "EMIC is a boutique company based in Egypt. Established in 2017 by professionals with 100 collective years of experience in development, management, and financial fields. EMIC offers a unique range of Management & Financial Consultancies, Accounting Outsourcing, Taxation and Financial Management Services for a variety of enterprises within the MENA region."
  },
  {
    "name": "Financial-Step",
    "link": "https://www.linkedin.com/company/financial-step/",
    "overview": "\nOur Vision: To introduce unique product to SMEs's sector more flexible more realistic.\n\nOur Mission: Introduce outsourcing services marketing, investigation, and remedial for financial farms cooperate \nwith them to create products compatible with our market needs. "
  },
  {
    "name": "SW & Co.",
    "link": "https://www.linkedin.com/company/swandco/",
    "overview": "SW & Co. provides trusted and professional banking consulting services. Our services are provided to banks and borrowers/depositors.\n\nLegal and Borrowing Documents:\nSW & Co. is aiming to help banks, whether a start-up or existing, to revamp their legal and borrowing documentation. We have expertise in the banking industry for more than 25 years with hands-on experience in this field. Our services can cover Islamic and Conventional Banking. We can provide this service in both Arabic and English languages. Our experts are having experience in both UAE and Egypt markets.\n\nBanking Consultancy:\nSW & Co. is aiming to help borrowers to deal with banks. We can help in:\n- Review the agreements and borrowing documents from a professional stand.\n- Statement review and reconciliation.\n- Interest calculation review and reconciliation.\n- Discuss the reschedule/restructure mechanism.\n\nTraining and People Management:\nSW & Co. provides training in the following fields:\n- Credit Aspects.\n- Credit Operations.\n- Banking Operation.\n- Fundamentals of Islamic Finance. \n- Banking Ethics and Professionalism. \n\nIn addition, SW & Co. provides the following staffing services to banks: \n- New staff interview. \n- Existing staff assessment. \n- Conduct satisfaction surveys."
  },
  {
    "name": "SCOPE INTERNATIONAL LTD",
    "link": "https://www.linkedin.com/company/scope-international-ltd/",
    "overview": "SCOPE INTERNATIONAL LTD offers a new saving based approach for clients risk assessment, risk placement evaluation, insurance file audit, credit insurance assessment, credit file and credit facilities arrangement, making us a one-stop-shop for all your insurance and financial service needs. \n\nWe connect Exporters with overseas Funders and Credit Insurers who are willing to insure and finance their export receivables whether from specific geographic locations or diversified portfolios.\n\nUsing our specialist knowledge, we believe that we are best placed to help you implement an innovative and cost-effective risk and insurance program, along with our artificial intelligence platform usage to best assist our clients in credit file arrangement and credit facilities provision. \n\nSCOPE INTERNATIONAL LTD - UAE is part of SCOPE INSURANCE GROUP that included SCOPE INSURANCE BROKERAGE S.A.E - EGYPT and SCOPE INTERNATIONAL CONSULTING AND TRAINING - EGYPT"
  },
  {
    "name": "Tatweer Group",
    "link": "https://www.linkedin.com/company/tatweer-group/",
    "overview": "Tatweer Group offers customized advisory programs for clients seeking high levels of investment expertise in addition to greater flexibility and convenience. Tatweer Group understands that your priorities change as you go through life. Through our Tatweer Group approach, we strive to make sure that your financial plan reflects these changes. This process ultimately requires a strategic wealth transfer plan for future generations. Our organization is dedicated to provide education excellence to meet the needs of each technology, simultaneously, as customer expand designed solutions to meet his particular organization's business needs."
  },
  {
    "name": "FEKRA company for economic consultation",
    "link": "https://www.linkedin.com/company/fekra-company-for-economic-consultation/",
    "overview": "شركة استشارات اقتصادية ودراسات جدوى مسجلة بالهيئة العامة للاستثمار المصرية "
  },
  {
    "name": "Golden StockFX",
    "link": "https://www.linkedin.com/company/golden-stockfx/",
    "overview": "Golden stock FX provides advisory services to the stocks market& the forex market.\nwith experience for more than seven years in the field of financial markets.\nGolden stock FX is one of the most important companies in the Arab Republic of Egypt that is specialized in providing services in the financial consultations and all essential training in the field of stock markets and forex by professional analysts and fundamentalists.\nGolden stock FX is your way to invest and make a profit.\nOur services:\nEducational services:\nThe company aims to increase community awareness and dissemination of the culture of investment ment, specialized training courses in the field of forex and stock exchange with professionals analysts and fundamentalists.\nWe empower our customers to learn all including on the:\ncirculation of stocks \nexchange in Forex\nstudy the technical analysis\nstudy Fundamental Analysis\nTechnical analysis:\nThe company provides technical analysis in the area of stock exchange free of charge to our customers and investors through its website and social media.\nThe professional trader service:\nThe possibility of allocating a professional analyst at a private live trading session with investors, through the step-by-step walkthrough market analyzing\nThe company offers programming expert advisers according to any idea that may pop up in traders minds"
  },
  {
    "name": "New Vision Consultant",
    "link": "https://www.linkedin.com/company/new-vision-consultant/",
    "overview": "تتشرف شركة نيوفيجن للإستشارات بتقديم نوع جديد من الخدمات التي تؤدي إلى تحقيق أهم سبل المتابعة والرقابة المطلوبة على المنشأة حيث تقوم شركتنا بما يلي :\n\t القيام بأعمال التسليم والتسلم لكافة الأصول الثابتة وإعداد سجلات أصول ثابتة للمنشأة وأعمال التسليم والتسلم لكافة الإدارات المختلفة من حيث الدورة المستندية والأعمال الموكلة لكل إدارة على حدا وذلك يتم وفق منظومة عمل محدده .\n\tالقيام بأعمال الإشراف والمتابعة للتشغيل والعمل على تحقيق الأهداف المطلوبه من خفض للتكاليف وزيادة مجمل الربح وذلك يتم وفق منظومة عمل محدده . \n\tالقيام بأعمال ممثل المالك والقيام من خلالنا بتحقيق بنود التعاقد المتفق عليها ما بين كلا من الشركة المالكة وشركة إدارة الفنادق وذلك يتم وفق منظومة العمل المرفقة .\n\tالقيام بأعمال المراجعة على كافة الإدارات داخل المنشأة وتقييم مستوى الأداء العام للإدارات المختلفة من حيث التشغيل ومن حيث الدورة المستندية المطلوبة لتحقيق الرقابة المالية المطلوبة وذلك يتم وفق منظومة العمل المرفقة .\n\tالقيام بإعداد سجلات للإصول الثابتة المميكنة بالمواصفات التفصيلية لكل أصل ثابت بنظام الباركود والقيام بإحتساب نسب الإهلاك السنوية لها مما يتطابق مع النتائج التحليلية للميزانية العمومية للمنشأة .\n (1) Delivery of all fixed assets and preparation of records of fixed assets of the establishment and delivery to all different departments in terms of the documentary cycle and the work assigned to each department on the basis of a specific system of work.\n(2) Conducting the audit work on all departments within the establishment and evaluating the general performance level of the different departments in terms of operation and documenting cycle required to achieve the required financial control, according to the attached work system.\n(3) NVC represents of the owner to achieve the terms of the contract agreed upon by both the owner company and the hotel management company in accordance with the attached work system.\n(4) Assets Management as per many kinds of Foundations and standards to prepare records of fixed assets with the detailed specifications of each fixed asset in the barcode system "
  },
  {
    "name": "SOLIRX",
    "link": "https://www.linkedin.com/company/solirx/",
    "overview": "\nWe as a technology company, our mission is based on three fundamental principles: innovation, quality and high technology. We invest a large amount of resources in maintaining the front and back front systems. Our main objective is to provide the basic programs and programs for investment companies and brokerage firms all over the world.\n\nWe have adopted the latest technologies and international standards to develop our General Trader platform.\n\nGeneral Trader is a comprehensive platform with all its components for back office and client terminals, servers dedicated to market makers, clearing houses, brokerage firms and trading rooms.\n\nWe have used more than ten languages ​and tools to develop the front end of the trading and communication content, and to present it as a single package called General Trader. The product ensures flexibility, reliability and security, and has shown excellent availability in all versions.\n"
  },
  {
    "name": "OnXe",
    "link": "https://www.linkedin.com/company/on-xe/",
    "overview": "We will save you a lot of effort while making difficult and important choices. You can view the stock prices live and be able to identify the best possible opportunities using our digital analytic tools.  \nThere is no need to complicate matters. Our stock analysis platform simplifies everything that is complex to help you keep pace with the speed of development in the financial industry. We were keen to establish a platform to manage investments in stocks using the latest methods used globally and to produce other ways that are suit investors’ need to make quicks decisions to buy and sell stocks. Our tools also assist you to draw up a financial plan to manage your portfolio and reduce risk in stock investing. We aim to bridge the gap between knowledge and application in order to provide our clients with an informed decision based on scientific methods. Through this platform, which can be considered an added value, the instantaneous prices of stocks are available for viewing through a careful automatic search for every opportunity that can be exploited to make the entire market under constant surveillance."
  },
  {
    "name": "edge portfolio management | egypt",
    "link": "https://www.linkedin.com/company/edge-portfolio-management-egypt/",
    "overview": "We are a boutique investment management firm that provides professional portfolio management services for its renowned clients in the Egyptian Capital Market.﻿\n﻿\n\"Our experience shows that if we serve our clients well, our own success will follow.\" Goldman Sachs﻿"
  },
  {
    "name": "Juste Valeur Financial Services",
    "link": "https://www.linkedin.com/company/juste-valeur-financial-services/",
    "overview": "- Licenced Valuators & Financial Advisors\n- Egyptian-Canadian Professional Joint-Venture\n- A fully integrated team of highly experienced professionals with an extensive knowledge of the Egyptian financial market, a proven track-record of over 100 meaningful transactions in Egypt, North-America and Europe\n- A network of international partners\n- A range of expertise covering virtually all business areas"
  },
  {
    "name": "Forex-Arts",
    "link": "https://www.linkedin.com/company/forexarts/",
    "overview": "NON"
  },
  {
    "name": "RS Financial Services",
    "link": "https://www.linkedin.com/company/rs-financial-services/",
    "overview": "We provide many accounting services for companies, and we also provide workshops to qualify for work ."
  },
  {
    "name": "Bee Financial Services",
    "link": "https://www.linkedin.com/company/bee-financial-services/",
    "overview": "في الوقت الذي اصبحت فيه تكلفة تعيين و تشغيل محاسب للعمل في الشركات السعودية مرتفعه جدا لما تشمله من أجر شهري و رسوم رخصة العمل و الأقامه و تذاكر الطيران و مكافأة نهاية الخدمه و الاجازة السنويه مرتفعه للغاية فقد نشأت الحاجه لتوفير تلك الخدمه من خلال محاسبين للعمل عن بعد مع تلك الشركات \nمن نحن \nنحن شركة مصرية تحت الانشاء تهدف لتوفير محاسبين و مدخلي بيانات يتم إختيارهم بعنايه تامه و حسب إحتياجات العميل للعمل مع تلك الشركات عن بعد بتكاليف تنافسيه"
  },
  {
    "name": "Receivables Management Consultancy - RMC",
    "link": "https://www.linkedin.com/company/rmceg/",
    "overview": "RMC is providing creative solutions in the debt collections field, credit control, training & process assurance.\n\nRMC provides tailored debt collection solutions to provide the highest level of service and advice aimed at collecting your debts as quickly and efficiently as possible."
  },
  {
    "name": "Wepeak Financial Advisors INC",
    "link": "https://www.linkedin.com/company/wepeak/",
    "overview": "WEPEAK INC. is a Joint Stock company founded in 2009, commercial license No. 58619/Cairo, subject to provisions of the Egyptian Capital Market Law No. 95/1992 and its implementing regulations, as amended.\n\nWEPEAK FINANCIAL ADVISORS INC. is a Financial Advisory Firm, a core business of WEPEAK INC., authorised and regulated by the Egyptian Financial Supervisory Authority (EFSA) under No. 552 and registered in the Financial Advisors Register as an Independent Financial Advisor under No. 1749 and a Nominated Advisor for Nile Stock Exchange (NILEX).\n\nWe provide independent and objective Wealth Advisory Services including Financial Planning and Investment Management Strategies to suit the diverse needs of Ultra-high net-worth and high net-worth client segments as well as institutional investors, in addition to Financial Advisory Services including Corporate Advisory and Business Valuation Needs that cater to corporate clients and business entities.\n\nInvestment Management products and services is a core offering within our Wealth Advisory Business. We offer the full spectrum of investment strategies – from rigorous fundamental and quantitative active management approaches aimed at maximizing outperformance to highly efficient indexing strategies designed to gain broad exposure to the world's capital markets.\n\n1) Business Valuation :\nBusiness Enterprise\nEquity & Stocks\nBonds & Sukuk\nMachinery & Equipment\nReal Estate\nIntangibles Property\n\n2) Investment Advisory Services:\nInvestment Solutions\nIndexes and Trading Strategies\nFinancial Planning and Risk Analysis\nIndependent Equity Research\n\n3) Corporate Advisory:\nBusiness Planning\nFeasibility Studies\nDue Diligence\nMerger & Acquisition\nCapital Raising\nStock Exchange Listing"
  },
  {
    "name": "NAG-Nour Advisory Group",
    "link": "https://www.linkedin.com/company/nag-egy/",
    "overview": "An economic, financial and accounting integrated entity, that was established more than 35 years ago. Approved by the highest regulatory and governmental authorities in Egypt and has long experience in all matters related to accounting, auditing and taxes."
  },
  {
    "name": "Charter Financial - Egypt",
    "link": "https://www.linkedin.com/company/charter-financial---egypt/",
    "overview": "Egypt's First Mortgage / Leasing Brokers\r\n\r\nCharter Financial Consultants was established in 2013 with the objective of liaising between real estate buyers, real estate developers and mortgage/leasing financing institutes.\r\n\r\nOur management team is a blend of different backgrounds between business management, retail banking, mortgages and retail credit with cumulative experience of over 50 years."
  },
  {
    "name": "OTA Egypt",
    "link": "https://www.linkedin.com/company/ota-egypt/",
    "overview": "OTA complies with your needs which covers accounting, costing, financial planning & analysis and feasibility studies.\nWe have a highly professional, qualified, certified and expert team specialized in all of the work scopes of the financial department."
  },
  {
    "name": "Trades Analysis",
    "link": "https://www.linkedin.com/company/trades-analysis/",
    "overview": "Trades Analysis provides consulting and training services in the field of the financial market."
  },
  {
    "name": "Cayshly",
    "link": "https://www.linkedin.com/company/cayshlyegypt/",
    "overview": "Cayshly is a payment method used to pay in your public transportation using an electronic wallet connected to your credit card, Mezza Card and other payment methods"
  },
  {
    "name": "Elite Financial Services",
    "link": "https://www.linkedin.com/company/elite-financial-services-tfa/",
    "overview": "Elite Financial Services, Our firm specializes in all tax matters and bookkeeping services will keep you on top of your finances so you can make your financial decisions for your business with confidence. \n"
  },
  {
    "name": "Capital Care Consultancy",
    "link": "https://www.linkedin.com/company/capital-care-consultancy/",
    "overview": "Capital care consultancy is an independent consultant & training provider for SMEs clients and large corporate, with an antecedence in SMEs sector supporting the Egyptian market since 2017 to level up. \n\nOur Vision:\nWorking to be one of the leading consultancy agents through utilizing our experience and previous practical knowledge and sciences.\n\nOur Mission:\nHelping clients create the future utilizing all what we have to optimizing they assets, repairing financial structure also credit structure, enhance human resources to the maximum by offering all required trainings in source and outsource, delivering new channels to ultimate they return to the max.\n\nOur Values:\n- Customer Service\n- Quality\n- Empathy\n- Respect\n- Integrity\n- Responsibility\n- Teamwork\n\nOur Social responsibility:\nOffering a various training courses for students of commerce and business administration from governmental universities only for free to prepare them to face they practical life and enhance they opportunities also . \n\nAs a business partner, Capital Care Consultancy offers a wide range of business services and solutions to insure an ultimate business transformation. Drive your business to maximum level of returns and profitability, this range of services and solutions offer you safe road to build the future.\n\n\nOur Services:\n-\tFinancial advisory.\n-\tInsurance advisory.\n-\tBusiness planning and development.\n-\tInvestment advisory.\n-\tFund Raising.\n-\tProject management.\n-\tRe engineering.\n-\tTraining and development.\n-\tRecruiting and outsourcing.\n-\tMarket survey.\n-\tRetail investigation.\n-\tCorporate investigation.\n\nSimply ... We Care, "
  },
  {
    "name": "financial consultant achieving your dreams",
    "link": "https://www.linkedin.com/company/financial-consultant-achieving-your-dreams/",
    "overview": "شركة اف سى تعتبر اول مستشار مالى يعمل بطريقة جديدة فى الاسواق لمساعدة العملاء من الافراد والشركات للحصول على الاستشارات المالية والخدمية فى الحصول على القروض والتمويلات المختلفة من مصادر التمويل المتنوعة دون مشقة التعب والبحث عن الجهة التمويلية المناسبة لتمويلك ولكن سنرسل لك الجهات المعتمدة والبنكية التى تستطيع فعلا تمويلك الى منزلك او مكتبك او عنوانك و لديهم افضل العروض والاسعار المختلفة للتمويل مما يساعدك على اختيار الجهة المناسبة باسهل واسرع الاجراءات لتنفيذ المعاملة بدقة\n\n\nFc company is considered the first financial consultant company working in a new way in markets to help both individual and company customers getting the financial and service consults to have various loans and finances from different sources of financing without exerting efforts to find the right one. We will send you the trustworthy accredited bank entities to your home, your office or wherever you are. They have various of brilliant offers and prices to help you pick up the most convenient authority with the easiest and fastest procedures to finish the transaction precisely."
  },
  {
    "name": "PHAROS SECURITIES BROKERAGE",
    "link": "https://www.linkedin.com/company/pharos-securities-brokerage/",
    "overview": "PHAROS SECURITIES BROKERAGE is a financial services company based out of Mazhar Lane, CAIRO, Cairo Governorate, Egypt."
  },
  {
    "name": "MORI Finance",
    "link": "https://www.linkedin.com/company/mori-finance/",
    "overview": "في شركات كثير بتحتاج للعديد من اشكال التمويل احنا بنساعدك خطوة بخطوة وبنشوف انسب انواع التمويل لنشاطك وطبقا لنسب ارباحك وتحليل ميزانيات .\nمتقلقش احنا هنساعدك وهنكون شركاء النجاح حتي الوصول الي التمويل المناسب لشركتك"
  },
  {
    "name": "MicroSafe Egypt LTD",
    "link": "https://www.linkedin.com/company/ai4microsafe/",
    "overview": "MicroSafe is an Egyptian limited liability company that built and operates an AI platform specialized in microfinance using machine learning technology. The MicroSafe platform serves non-profit associations and companies working in microfinance in Egypt. We offer live predictions of the borrowers behavior. Predicted behavior is described in terms of probability of repayment as well as the expected duration of delays if any, and identifying the best timing for follow-up with customers to avoid delays in payment. The platform also features a tool that predicts repayment behavior  by location, sector, age group, gender, or combinations thereof to assist microfinance  companies plan their business development in new markets."
  },
  {
    "name": "Claremont Wealth",
    "link": "https://www.linkedin.com/company/claremont-wealth/",
    "overview": "Claremont Wealth is an independent financial consultancy that has two main divisions, Private Client and Corporate Services.\n\nOur Private Client business offers advisory and wealth management solutions to individuals with international lives. Our clients take advantage of international financial markets and the structures available to them. Through our partnerships in the UK and EU, we can offer on the ground FCA regulated and MIFID licenced advisory services.\n\nOur Corporate Services division is dedicated to assisting businesses with financial processes. Our core service is Business Payment Solutions (how you transfer money) and Foreign Exchange. \n\nWe start this process by getting to understand your business. We work with the business, and its employees, to gain a better understanding of your current payment systems and processes. Fundamental to the entire process is obtaining previous transaction data for our analysis.\n\nThe team take all relevant information gathered and analyse all possible solutions and structures available. These solutions range from providing access to an exotic currency, reducing your online card payment fees or simply providing better FX rates.\n\nOur dedicated corporate services support team work closely with your business to implement the solution, we provide training for the team and continue to support them once the solution is fully established.\n\nWe work with businesses of all sizes, so should you be a SME coffee importer looking to save money on import exchange, or a multinational looking for lending to improve cash flow or fix your FX rates, we are here to help. \n\nTo find out more about the entire range of corporate services, or to complete a complimentary audit of your current payment process, please contact one of the team on info@claremontwealth."
  },
  {
    "name": "Strategy Financial Advisors-SFA",
    "link": "https://www.linkedin.com/company/strategy-financial-advisors/",
    "overview": "SFA covers audit, tax and corporate advisory services in Egypt and United Arab Emirates. Also, it is UAE federal tax authority (FTA) approved tax consultant and agent. "
  },
  {
    "name": "Total Credit Managements \"TCM Egypt\"​",
    "link": "https://www.linkedin.com/company/total-credit-managements-tcm-egypt/",
    "overview": "TCM Egypt is a Credit Risk Management Company (stock Co) founded in November 1999 under the Egyptian Law 159 for the year 1981 and a shareholder at TCM Group International, Active member of WAD, Affiliate member of FENCA and Overseas member of ABI. We operate in 150+ Country worldwide. Our services include worldwide Collection, Investigation/due diligence and listing for defaulters, through cooperation with the Egyptian credit bureau and different Business communities/Commercial chambers."
  },
  {
    "name": "Huobi Egypt",
    "link": "https://www.linkedin.com/company/huobi-egypt/",
    "overview": "صفحة تمثل مستخدمى منصة هوبى جلوبال فى مصر و العالم العربى \nحجم التداول بالمنصة يتجاوز 600 مليون دولار يوميا "
  },
  {
    "name": "Piraeus Egypt Leasing Company S.A.E",
    "link": "https://www.linkedin.com/company/piraeus-egypt-leasing-company-s-a-e/",
    "overview": "Piraeus Egypt Leasing Company S.A.E is a financial services company based out of Egypt."
  },
  {
    "name": "Egyptian Gulf Company for Consulting (EGCC)",
    "link": "https://www.linkedin.com/company/egyptian-gulf-company-for-consulting/",
    "overview": "OUR VISION\nWe strive to be at a standard of distinction attained by \nBeing the first choice of the most sought after clients, inclined by our keenness depicted through our professional efforts to provide exceptional, timely and value for money services to help our clients make the best business decisions.\nProviding clients with ‘One-Stop Solution’ for all their financial advisory, taxation, management consulting, research, and regulatory requirements.\nGuiding our clients in business challenges by understanding their specific needs and bringing together experienced, knowledgeable and expert professionals to address them.\n\nWHAT WE DO\nAt EGCC, we have multi-disciplinary skills to address a range of services that our clients require in dealing with composite matters in the areas of Financial and Risk Advisory, Tax Advisory, Corporate Finance and Deal Advisory, Legal Advisory, Management Consultancy, and Other Specialized Services.\n\nWe work with our clients to provide advice and assistance in developing and implementing the most suitable business strategies sufficing their particular needs.\n\nWe serve our clients at every level of their organization, whether as a trusted advisor to top management or as a hands-on coach for front line employees. At EGCC, we bring much-needed capabilities and extraordinary local expertise to address your needs, your stakeholder’s expectations and to cater your regulatory obligations.Our exclusive performance methodologies and analytical tools enable our clients to run their business more effectively and efficiently."
  },
  {
    "name": "Pyramids Capital Securities Brokerage",
    "link": "https://www.linkedin.com/company/pyramids-capital-securities-brokerage/",
    "overview": "Pyramids Capital Securities Brokerage is a financial services company based out of Giza, Egypt."
  },
  {
    "name": "KHAZANAH Treasury & Risk Advisors",
    "link": "https://www.linkedin.com/company/alkhazanah/",
    "overview": "NON"
  },
  {
    "name": "Watheeqa Securities Brokerage Company",
    "link": "https://www.linkedin.com/company/watheeqa-securities-brokerage-company/",
    "overview": "Watheeqa Securities Brokerage Company is a financial services company based out of Al Taamir Tower 4A, Cairo, Cairo, Egypt."
  },
  {
    "name": "Hermes Financial Management (Egypt) Ltd",
    "link": "https://www.linkedin.com/company/hermes-financial-management-egypt-ltd/",
    "overview": "Hermes Financial Management (Egypt) Ltd is a financial services company based out of Egypt."
  },
  {
    "name": "Markets Voice",
    "link": "https://www.linkedin.com/company/markets-voice/",
    "overview": "Markets Voice is an independent website with a comprehensive Arabic reference in the field of economy, investment and entrepreneurship. Under the patronage of Drupia Technology Solutions, Markets Voice has opened its doors in 2014, with a website that provides a wide range of services that help all investors worldwide to build up a huge corpse of knowledge in various investment fields. Such corpse is accumulated to help you to choose the best financial decision. \r\n\r\nماركتس فويس هو موقع اقتصادي مستقل، ويعتبر أول مرجع عربي يضم العديد من الموضوعات منها: الاقتصادي، الاستثماري، وريادة الأعمال. تم انشاءه في عام 2014 تحت رعاية شركة دروبيا للحلول التقنية. يقدم الموقع خدمات للمستمثرين لمساعدتهم في بناء قاعدة معرفية عريقة في مجالات الاستثمار المختلفة وكيفية تطوير أفكارهم الاستثمارية، ليساعدك على الاختيار الانسب، في ظل أسواق لا تهدأ ولا تتوقف. \r\n\r\nالتقاريرالاقتصادية\r\nتقدم تقارير شركة ماركتس فويس تغطية لحظية شاملة ومتكاملة للأسواق المالية والاقتصادية المحلية والعالمية. كما توفر بعض التوقعات المستقبلية لأداء الأسواق المالية.\r\n\r\nالتحليل الفني\r\nيوفر فريق المحللين بشركة ماركتس فويس تحليلات فنية شاملة لأزواج العملات الأساسية، والأسواق العربية والأجنبية وأسواق الأسهم. \r\n\r\nالمدونات\r\nتتناول مدونات ماركتس فويس موضوعات متنوعة تفيد جميع المهتمين بالاقتصاد. وتناقش تلك المدونات موضوعات عديدة في مجالات مختلفة منها: الاستثمار، الاقتصاد، البورصة، الرياضة، وريادة الأعمال.\r\n\r\nالاكاديمية\r\nتوفر شركة ماركتس فويس كورسات تعليمية في مجالات شتى منها الاقتصادي، والمالي، والاجتماعي والاستثماري، والتسويق. \r\n\r\nالفيديوهات\r\nيقدم موقع ماركتس فويس خدمة ترجمة فيديوهات متنوعة في العديد من المجالات الاقتصادية والمالية والاستثمارية. كما تحتوي تلك الفيديوهات على معلومات اقتصادية قيمة تساعد على المستثمرين على الفهم الدقيق للموضوعات الاقتصادية والمالية المختلفة."
  },
  {
    "name": "Delmont AMC LLC",
    "link": "https://www.linkedin.com/company/delmont-amc-llc/",
    "overview": "Delmont Asset Management & Consulting LLC is a privately owned business that offers various consulting services for both SMEs and Multinationals.\nOur services include:\nFixed Asset Management using RFID technology.\nCost & Financial Management.\nImplementing Innovative Asset Tracking Systems.\nTax & Accounting Services for SMEs.\nBusiness Consulting  Services for SMEs.\n\n\n"
  },
  {
    "name": "IMM.Exchange",
    "link": "https://www.linkedin.com/company/imm-exchange/",
    "overview": "IMM Exchange is a leading cryptocurrency exchange platform providing world-class p2p exchange services all around the globe. At IMM.Exchange one can experience smooth trading of cryptos or other digital assets."
  },
  {
    "name": "Ehab Raafat Thabit Establishment",
    "link": "https://www.linkedin.com/company/ehab-raafat-thabit-establishment/",
    "overview": "Ehab Raafat Thabit Establishment for financial services & Tax consultants "
  },
  {
    "name": "PAY EG",
    "link": "https://www.linkedin.com/company/pay-eg/",
    "overview": "PayPal Solutions In Egypt"
  },
  {
    "name": "Piraeus Real Estate Egypt LLC",
    "link": "https://www.linkedin.com/company/piraeus-real-estate-egypt-llc/",
    "overview": "Piraeus Real Estate Egypt LLC is a financial services company based out of Egypt."
  },
  {
    "name": "Global Business - MENA",
    "link": "https://www.linkedin.com/company/global-business---mena/",
    "overview": "NON"
  },
  {
    "name": "Financial Universe",
    "link": "https://www.linkedin.com/company/financialuniverse/",
    "overview": "We are a group of ambitious and persistent believers with more than 10 years’ experience in the business fields as making a lot of achievements for more than 100 Companies over Egypt;"
  },
  {
    "name": "El Tarazi Exchange",
    "link": "https://www.linkedin.com/company/el-tarazi-exchange/",
    "overview": "El Tarazi Exchange is a top tier FX firm in Egypt with a the large branch network."
  },
  {
    "name": "Wealth advisor for Financial & legal consultants",
    "link": "https://www.linkedin.com/company/wealth-advisor-for-financial-legal-consultants/",
    "overview": "We provide our clients with advisory services, financial advisory, financial legal advisory, financial consultancy services, commercial financial advisory, direct tax services to our clients. Having proficiency in handling different financial problems, we also provide them with our advisory services."
  },
  {
    "name": "Integra (Integrated Financial Services)",
    "link": "https://www.linkedin.com/company/integra-integrated-financial-services-/",
    "overview": "“Integra” established since 2000, is a Private Egyptian Joint Stock Company; the first-ever established strategic corporate advisory firm in Egypt, managed by a core of seasoned professional bankers, senior consultants, Financial, Marketing & Management Professionals well recognized within the Egyptian market venue, offering diversified value-added financial, management & strategic advisory services to its corporate clients\r\n\r\nCORPORATE CREDENTIALS\r\n• Strategic corporate advisory firm with strong linkage to diversified private corporate clients operating within a wide range of business activity sectors\r\n• An Expanding Financial & Allied Management Consultancy Network in Egypt, the Gulf, Europe & USA\r\n• Advised/arranged a large number, most complicated finance packages totaling Egyptian Pounds 12.2 billion since mid 2000\r\n• Established an ever-expanding corporate clientele in the Medical Care, Pharmaceutical, Tourism, Food & beverages, Dairy Production, Oil & Gas, Food & Cafe retail chains, Feeder Ship container Terminals & Marine Ports Management Services. Agribusiness, Industrial Packaging, Inland Freight transport & Warehousing Logistics Management\r\n\r\nOUR SERVICES\r\n• Mergers & Acquisitions.\r\n• Strategic Sale.\r\n• Financial Restructure Management.\r\n• Structured Finance/Lease Finance.\r\n• Asset Turnaround/Financial Management.\r\n• International Trade Finance.\r\n• Corporate Evaluation.\r\n• Internal Financial Audit/Corporate Governance.\r\n• Financial Arbitrations Advisory.\r\n• Marketing Development/Brand Value Creation."
  },
  {
    "name": "AFC. Experts For Financial Consultancy's",
    "link": "https://www.linkedin.com/company/afc-experts/",
    "overview": "AFC. Experts for financial consultancy's an Egyptian shareholding company which work on the following activities. \r\n1. The establishment of companies and end all proceedings relating to.\r\n2. Audit activities in accordance with Egyptian and international Accounting Standards.\r\n3. Feasibility studies, financial and tax consulting for projects.\r\n4. Rehabilitation and Development Companies to get the quality certificates of various kinds.\r\n5. The administrative restructuring of the companies.\r\n6. rehabilitation of individuals and the development of personal skills, according to the nature and requirements of the job.\r\n\r\nMission;\r\n AFC. Experts mission is the provision of quality services to our clients."
  },
  {
    "name": "AFK ShineWing Egypt",
    "link": "https://www.linkedin.com/company/afk-shinewing-egypt/",
    "overview": "Founded in 1955, Fathy Kamel & Co is one of the leading accounting & advisory firms in Egypt. For more than 55 years we enjoyed a very strong reputation in our field. Based in the heart of Central Cairo, we offer accounting, audit, tax and business consulting services. We enjoy our success and good reputation in our field.\nFathy Kamel & Co lately Joined “ShineWing International” and was rebranded as “ShineWing Ayman Kamel”. SWI is a global network of independent accounting and consulting firms. With the progressive expansion, ShineWing was selected as the winner for the category \"Rising Star Network\" for the International Accounting Bulletin (IAB) Awards 2015.\nShinewing is a member of Praxity, the world's largest Alliance audit and consultancy companies. Recognizing the support arising from globalization we are able to recommend renowned companies in significant countries. Our contacts to these Praxity participating firms enable our clients a professional support in their transnational activities from a single source.\nPraxity is the biggest alliance of independent accountancy and consulting firms. It facilitates the sharing of expertise among its participant firms around the world. Each participant firm hand-picks expert advisers from nearly 40,000 professionals in over 100 countries. These expert advisers work together seamlessly in multidisciplinary teams across international borders to meet every client need. Praxity participant firms have a combined turnover of USD 4.5 billion. Collectively, they have achieved the greatest revenue growth in the profession."
  },
  {
    "name": "Castle For Accounting",
    "link": "https://www.linkedin.com/company/castle-for-accounting/",
    "overview": "Castle For Accounting  Services offers a wide range of accounting solutions for businesses and individuals. With tax laws constantly changing and the use of electronic banking a common practice, professional accounting services are more important now than they’ve ever been."
  },
  {
    "name": "Crestmount Capital Limited",
    "link": "https://www.linkedin.com/company/crestmount-capital-limited/",
    "overview": "Crestmount Capital (Crestmount) is a global real estate fund manager that strives to contribute to the exciting advancement of our target market’s social and economic evolution.\n\nOur goal is to provide our clients with the ‘Best in Class’ international real estate investment and asset management vehicles. Utilizing a formulaic and strategic investment path, Crestmount’s financial instruments are expertly managed by the in-house team.\n\nCrestmount works within the Islamic finance segment, ensuring that the investments are deployed and maintained within the parameters of Sharia-compliant global standards and adhering to best practices.\n\nWith the close guidance of an external and impartial Sharia Supervisory Board (SSB) on Crestmount Fund I that includes the foremost opinion leaders in Islamic economics and finance, Crestmount funds invest in risk- mitigated Sharia-compliant projects that demonstrate an agile return schedule.\n\nCrestmount Capital applies internationally accepted best practices together with a corporate schema comprised of the following essential : transparency, ethics, relationship management, and independent expert oversight.\n\n"
  },
  {
    "name": "SANNAD For Financial and Legal Solution",
    "link": "https://www.linkedin.com/company/sannad-for-financial-and-legal-solution/",
    "overview": "دورنا في SANNAD هو مساعدة أصحاب المشروعات الناشئة والصغيرة على البدء فى سوق العمل بداية صحيحة من خلال تقديم خدمات متعلقة بتأسيس الشركات ومعاملاتها الحكومية في كافة الإجراءات القانونية لتعزيز وضعها القانوني.\n بالإضافة إلى خدماتنا المحاسبية المختلفة لجميع أنواع الشركات والأنشطة\nهاتحل مشاكلك القانونية وهاتنظم حسابات مشروعك من مكان واحد بسعر أقل\n"
  },
  {
    "name": "HBCA",
    "link": "https://www.linkedin.com/company/hbcaeg/",
    "overview": "Financial services"
  },
  {
    "name": "NCO For Accounting, Auditing & Financial Consultancy",
    "link": "https://www.linkedin.com/company/nasser-consulting-office-nco/",
    "overview": "NCO provides audit, tax and advisory services. We work closely with our clients, helping them to mitigate risks and grasp opportunities."
  },
  {
    "name": "Khodeir Consulting",
    "link": "https://www.linkedin.com/company/khodeir-consulting/",
    "overview": "Khodeir Consulting is the oldest Egyptian financial firm in the market. With 80 years of experience in Taxes, Financial and Accounting Advisory, Management Advisory, Audit and Administration.\n\nKhodeir Consulting is a member of GMN International Association."
  },
  {
    "name": "Lendawy",
    "link": "https://www.linkedin.com/company/lendawy/",
    "overview": "Lendawy is a p2p lending marketplace that allows investors to lend money directly to small and medium-sized businesses. It connects retail investors with borrowers of many loan originators. Invest in loans and earn money online."
  },
  {
    "name": "El Mahrousa For Securities Trading",
    "link": "https://www.linkedin.com/company/el-mahrousa-for-securities-training/",
    "overview": "Stocks,bonds and securities trading in Egyptian stock market"
  },
  {
    "name": "ABC Consulting-EGY",
    "link": "https://www.linkedin.com/company/abc-consulting-egy/",
    "overview": "تأسيس جميع الشركات لدى هيئة الاستثمار ومصلحة الشركات.\nحل جميع المشاكل الضريبية امام مصلحة الضرائب والمحكمة الاقتصادية.\nاعداد الاقرارات الضريبية (الدخل/المبيعات/العقارية )\nاعداد دراسات الجدوى للمشروعات الجديدة والمتجددة.\nحل جميع المشاكل المصرفية مثل قروض البنوك وكروت الفيزا امام البنوك والمحكمة الاقتصادية.\nتدريب المحاسبين."
  },
  {
    "name": "IsadoraConsultancy",
    "link": "https://www.linkedin.com/company/isadoraconsulting/",
    "overview": "The company is responsible for providing financial, administrative and legal advice in addition to planning for small and medium companies, By a team of\n the largest consultants and experts in Financial, Economic and Administrative Consulting\nH.D & H.R Training\ncall us now and start your business"
  },
  {
    "name": "Yellow-fleet",
    "link": "https://www.linkedin.com/company/yellow-fleet/",
    "overview": "If you do have the money we could find you the\nright project, if in need of business diversification\nwe could tell you what to do and how to tailor your\ncash flow cycle , if you don't know where to start we\ncould assess you start, and before and after\nanything we could always advice you financially and\ndo for you the proper assessment and valuation."
  },
  {
    "name": "Capital Community Consultancy CCC",
    "link": "https://www.linkedin.com/company/capital-community-consultancy-ccc/",
    "overview": "Since 2007 CCC provides consultations and project management services for many fields (economic,\r\nFinancial, administrative, and technical) in all sectors."
  },
  {
    "name": "Invopal",
    "link": "https://www.linkedin.com/company/invopal/",
    "overview": "Create and Send Invoices\nWith Invopal, send invoices to your clients by SMS, email or directly through the Vapulus payment app. FREE. Start getting paid today."
  },
  {
    "name": "Muhammad Rezk",
    "link": "https://www.linkedin.com/company/muhammad-rezk/",
    "overview": "مكتب للمحاسبة القانونية تم الانشاء في 2013 متخصص\nفي المراجعه الداخلية والخارجية\nوانشاء الشركات ودراسة جدوتها و تكوين الدورة المحاسبية للشركة وتحليل موقفها المالي و\nكافة ما يتعلق بالضرائب"
  },
  {
    "name": "Cairo National Company for Investment and Securities S.A.E.",
    "link": "https://www.linkedin.com/company/cairo-national-company-for-investment-and-securities-s-a-e-/",
    "overview": "Cairo National Company for Investment and Securities S.A.E. is a financial services company based out of Al Tahrir Tower 9, Giza, Giza, Egypt."
  },
  {
    "name": "EGY FX",
    "link": "https://www.linkedin.com/company/egy-fx/",
    "overview": "EX EGYFX Company:\r\n\r\n- Financial and economic consulting for small and large businesses and individuals.\r\n- Feasibility studies for large and small projects.\r\n- Intervention in financial problems and cases of liquidation for companies.\r\n- Provide a full study of projects and their implementation."
  },
  {
    "name": "Honest Income Online",
    "link": "https://www.linkedin.com/company/honest-income-online/",
    "overview": "•\tThe financial education most people never receive!\r\n\r\n•\tOur program teaches people how to stabilize and secure their personal finances.\r\n\r\n•\tMembership to over a dozen world class alliances that will help people setup a 6-month emergency fund, living will and trust, increase their credit score, get out of debt, and more.\r\n\r\n•\tTeaches people how to setup a proper business entity for asset protection and minimizing their taxes.\r\n\r\n•\tMore information at the following link:\r\nhttp://oneyearplan.net/jm_ottawa/?t=009"
  },
  {
    "name": "FXOpen Egypt",
    "link": "https://www.linkedin.com/company/fxopen-egypt/",
    "overview": "FXOpen Egypt is Official Regional Representative of FXOpen Financial Group in Middle east, North Africa and Gulf.\r\n\r\nFXOpen is a brokerage company with the main principle to offer the clients only what traders really need. That statement has been already proved to be true by the development track record and the whole history of the Company. \r\n\r\nFXOpen was founded in 2003 as an educational center of technical analysis meeting the demand for specialized knowledge that ensures efficient trading. After 2 years, in 2005, the decision to open own brokerage center was made – and that step provided traders from all over the world with trading conditions of the highest quality, an excellent customer support and ongoing updates of the whole service. \r\n\r\nIn 2009 FXOpen was the first one to offer and introduce MT4 Trading Platform to provide traders with the access to the ECN market – and it was a real breakthrough. \r\n\r\nAfter that the Company developed ECN/STP technology, introduced PAMM accounts, provided one of the lowest spread in the industry, showed really small minimum deposits, big leverages, super-fast execution and more. All that features together with trader-oriented approach, convenient trading conditions and the desire to move forward prove FXOpen to be an honest, modern and customer-friendly brokerage service."
  },
  {
    "name": "UCX Zone",
    "link": "https://www.linkedin.com/company/ucx-zone/",
    "overview": "Online platform that helps companies find the right investors and helps PE and investors find the right deals"
  },
  {
    "name": "EdFi-Education Finance Co.",
    "link": "https://www.linkedin.com/company/education-finance-co/",
    "overview": "Our Product is a Student Loan for undergraduate,graduate and training  programs,with a Key Essential to get ahead in life .\n\nEasy,Free& Quick online Approval   ."
  },
  {
    "name": "East Coast Advisory and Development",
    "link": "https://www.linkedin.com/company/east-coast-advisory-and-development/",
    "overview": "East Coast Advisory was established in 2018 by veterans in the real estate investment industry with combined experience exceeding 60 years of professional service. The company's body of experience is in engineering, project management, investment management and funds management positioning East Coast as a knowledgeable player with 360 view on the industry.  East Coast is dedicated to real estate finance and investments as well as policy analysis and real estate economics. The company provides active management and advisory consultancy in a holistic manner to the real estate stakeholders in Egypt, Middle East and Africa with a mandate of creating value to clients and stakeholders at large by spotting the optimum investment scheme suitable for different assets.  "
  },
  {
    "name": "SKEW GLOBAL",
    "link": "https://www.linkedin.com/company/skew-global/",
    "overview": "SKEW GLOBAL is a financial services company based out of Egypt."
  },
  {
    "name": "BFG-Egypt",
    "link": "https://www.linkedin.com/company/bfg-egypt/",
    "overview": "BFG is a Financial service company in Egypt , it has Four lines of services: audit, tax, Bookkeeping and advisory."
  },
  {
    "name": "ENHANCE Financial Advisory",
    "link": "https://www.linkedin.com/company/enhance-financial-consultancy/",
    "overview": "Enhance is a financial advisory firm that think and behalf beyond the limits of traditional financial and business models to help companies compete in new ways and exploit opportunities to achieve profitable growth, ultimately empowering companies to accelerate profits and reach business efficiency.\nWe offer you, providing you with plans for either increasing the scale of your business.\n\nOur strong relationships with banks and institutional lenders in addition to our access to the top tools and professional expertise will help us deliver innovative financing solutions that create substantial value for our clients. We acquire a successful track record of completing large transactions for several corporate houses speaks of our strong business advisory and fund raising expertise."
  },
  {
    "name": "الديوان للإستشارات المالية Aldiwan Financial Consultancy",
    "link": "https://www.linkedin.com/company/aldiwanfc/",
    "overview": "-تأسيس الشركات واستخراج كافة انواع الرخص اللازمة لمزاولة النشاط\n-الإستشارات والمراجعة الضريبية والفحص الضريبي\n-مراجعة الحسابات\n"
  },
  {
    "name": "One State Capital",
    "link": "https://www.linkedin.com/company/areli-financial/",
    "overview": "NON"
  },
  {
    "name": "Mortgage Finance Fund",
    "link": "https://www.linkedin.com/company/mortgage-finance-fund/",
    "overview": "Mortgage Finance Fund is a financial services company based out of Egypt."
  },
  {
    "name": "Egyptian Capital Market Association ECMA",
    "link": "https://www.linkedin.com/company/egyptian-capital-market-association-ecma/",
    "overview": "تعد الجمعية المصرية للأوراق المالية أول وأعرق جمعية مهنية مستقلة ذاتية التنظيم في أسواق المال والقطاع المالي والاستثماري، والتي سعت منذ نشأتها وعلى مدار تاريخها والذي أمتد إلي أربعة وعشرون عاماً لتطوير وتنمية سوق المال المصري والقطاع المالي والاستثماري ونشر الثقافة الاستثمارية وتبنى المبادرات الداعمة وتقديم التوصيات بشأن التشريعات المنظمة والتنسيق بين الأعضاء العاملين في قطاعات سوق المال المصري والقطاع المالي والاستثماري وحماية حقوقهم والدفاع عن مصالحهم وخلق حلقة الوصل بينهم وبين الجهات التنظيمية والرقابية، والعمل على تحقيق مصالح الأعضاء من خلال حل مشاكلهم ومواجهة التحديات وإزالة العوائق وتأهيل الكوادر المهنية ورفع كفاءة المستوى المهني في هذه القطاعات والتي تعد الشريان الرئيسي للاقتصاد المصري.\n\nوتأسست الجمعية المصرية للأوراق المالية في 16 أبريل 1996، وضمت في عضويتها كافة التخصصات من مؤسسات وأفراد في كافة قطاعات الاقتصاد المصري وأسواق المال والقطاع المالي والاستثماري والمؤسسات المالية المصرفية وغير المصرفية والمؤسسات المقيدة في البورصة المصرية والتي تشمل (قطاع البنوك والمتعاملون الرئيسيون وأمناء الحفظ؛ قطاع التأمين؛ قطاع تداول الأوراق المالية وصانع السوق؛ قطاع إدارة الأصول والمحافظ والصناديق؛ قطاع رأس المال المخاطر والشركات القابضة؛ قطاع الترويج وتغطية الاكتتابات في الأوراق المالية؛ قطاع الاستشارات المالية عن الأوراق المالية وتقييم وتحليل الأوراق المالية والتقييم والتصنيف الائتمانى للبنوك والمؤسسات المالية؛ قطاع السندات والتوريق والتصكيك؛ قطاع التأجير التمويلي والتخصيم؛ قطاع وكلاء القيد في البورصة المصرية، قطاع المستشاريين الماليين المستقليين؛ قطاع الرعاة المعتمدين في بورصة النيل؛ قطاع الشركات المقيدة في البورصة المصرية؛ قطاع التمويل المتناهي الصغر والاستهلاكي؛ قطاع التمويل العقاري؛ قطاع نشر المعلومات عن الأوراق المالية.\n"
  },
  {
    "name": "Customized Managment Solutions",
    "link": "https://www.linkedin.com/company/customized-managment-solutions/",
    "overview": "CMS is your “One stop consultant” for clients seeking trustable and customized managerial & financial advice for Businesses. \n\n"
  },
  {
    "name": "Egyptian Kuwaiti Securities Brokerage",
    "link": "https://www.linkedin.com/company/egyptian-kuwaiti-securities-brokerage/",
    "overview": "Egyptian Kuwaiti Securities Brokerage is a financial services company based out of 10 El-Obour Building, Maadi, Cairo, Egypt."
  },
  {
    "name": "PTP - PromiseToPay - Credit Risk Management & Collection Agency",
    "link": "https://www.linkedin.com/company/ptpegypt/",
    "overview": "PTP - PromiseToPay is a Credit Risk Management & Collection Agency\n\n"
  },
  {
    "name": "Trillion World Investments",
    "link": "https://www.linkedin.com/company/trillion-world-investments/",
    "overview": "NON"
  },
  {
    "name": "A&T Business Consultants",
    "link": "https://www.linkedin.com/company/a-t-business-consultants/",
    "overview": "A&T business consultants offer full range of financial and taxes services. Whether tax planning, financial reporting, business tax return, bookkeeping, new start up, business strategies and advisory. We have the experience to provide services to different types of companies & enterprises working in several industries.\nOur firm offers specialized services to our clients through a solid organization structure that include high qualified experts assigned to different departments in various fields.\n\nIn addition to a wide range of financial professional courses like CPA, CFA,  IFRS CMA. As well International Management Soft Skills training courses."
  },
  {
    "name": "Forex Trend Prediction Program",
    "link": "https://www.linkedin.com/company/forex-trend-prediction-appplication/",
    "overview": "This program provides indivisuals with the trend of the \"Forex market\"​ regarding High, Low and Close prices.\nThe program is adjustable according to the consumer's need regarding the time frame (It can work on minute, hour or day predictions) and with different currency pares as needed.\nThe accuracy is reliable and high for both (high and low prices) and it is decent for the close price.\n"
  },
  {
    "name": "DENTAL CASHFLOW",
    "link": "https://www.linkedin.com/company/dental-cashflow/",
    "overview": "DENTAL CASHFLOW is offline financial management and point of sale application for Dental Clinics on android mobile devices. By using DENTAL CASHFLOW, you can easily maintain your all kinds of Dental Clinic sales records. You can store Patients information. You can easily see your daily, monthly, and yearly reports with bar charts. Also, there is a backup facility. You can back up your database and save it to device storage and you can import it. You can easily generate PDF receipt and print receipt via a printer. You can also share PDF receipts with customers and manage your daily sales smartly.\nMain Features:\n• Create Patients information.\n• Create treatment or dental materials information with an image.\n• Edit treatment information\n• Generate PDF receipt\n• Print PDF receipt by POS printer\n• Share PDF receipt to customers\n• Open PDF receipt by external PDF readers\n• Add Dental Materials using QR code\n• Add receipt using Barcode code\n• Dental Materials management system\n• Dental Materials Stock count\n• Treatment by category\n• Search patient receipt using QR and Barcode\n• Create an expense list.\n• Add/Edit Treatment category\n• Add/Edit payment method\n• Daily, monthly and yearly report with a bar chart\n• Database backup and restore the system.\n• Data backup and import from Google Drive\n• Add any currency symbol\n• Attractive User Interface.\n• Tax and discount system\n• Thermal Printing support\n• Import Treatment and dental materials data from Excel(xls) file\n• Export Treatment and dental materials data into Excel(xls) file\n• Import Patients and supplier’s data from Excel (xls) file\n• Export Patients and supplier’s data into Excel\n• Export all sales data into Excel file\n• Export all expense data into Excel file\n• Export full database into Excel\n• Android 10 compatible"
  },
  {
    "name": "I-Reports",
    "link": "https://www.linkedin.com/company/i-reports/",
    "overview": "Across 15 years of experience in the field of Financial and Reporting Carries in both Manufacturing and service companies and its interact with industry ( including competitors, Clients, and vendors).\nI Found that a lot of businesses forms still missing how to adopt them selves in such a huge and dynamic environment with tough competition.\nMy vision is to helping  SMEs to achieve their Objectives, Goals, and key performance indicators (KPIs) through a patented, performance-based advertising platform. Through Organized Reporting packages, and Interactive business insights. And Providing Required Consultancy services to create a strong internal Policies and Procedures.\nThe Main Question here for any business owner is about Cost / Benefit aspect. Is it deserve to spend time and resources to develop such Policies and Procedures or powerful reporting Packages.\nMy Answer is yes, you build your strategic future to position your company in the right place in the market. Whatever the time or cost spent today, it is an investment and you will get its returns in both short run and long run.\nThe most Important benefits you will get:\nOutsource activities. We grant you a professional support in all Legal, HR, Marketing, Tax, Financial Services and IT aspects.\nFormation and Automation of your business Policies and Procedures or powerful reporting Packages. Which helps you to take the right decision in the right time.\nHelping you in designing your Business Model which achieves your Marketing integration objectives and goals.\nRecommendations to our clients and partners to deal with you, if they need your products or service.\nWelcome to the world of automation :-) .\n"
  },
  {
    "name": "EKROBY",
    "link": "https://www.linkedin.com/company/ekroby/",
    "overview": "يعد النظام المالى والمحاسبى من العوامل الهامة للنجاح اى شركة حيث انه وسيلة الشركة الوحيدة لقياس نتائج الشركة ومعرفة مركزها المالى وكذلك موقف السيولة لديها وكل ماكان لدى الشركة نظام محاسبى سليم وقوى كلما كانت النتائج الصادرة منه تعبر عن نتائج النشاط والمركز المالى للشركة مما يساعد الادارة فى اتخاذ القرارات المناسبة لصالح الشركة لذا نقوم بتقديم خدماتنا المحاسبية عن طريق متخصصون لديهم الخبرة المناسبة ووفقا لاحدث معايير المحاسبة المصرية داخل مصر والمعاييرالدولية بالخارج ."
  },
  {
    "name": "CS Solutions",
    "link": "https://www.linkedin.com/company/capital-sweep/",
    "overview": "NON"
  },
  {
    "name": "Tawriq",
    "link": "https://www.linkedin.com/company/tawriq/",
    "overview": "Financial securitization firm"
  },
  {
    "name": "Economic Blog",
    "link": "https://www.linkedin.com/company/economicblog/",
    "overview": "\nEconomic Studies, Forex & Financial Markets, E-Commerce\n"
  },
  {
    "name": "CryptoNewsArabia",
    "link": "https://www.linkedin.com/company/cryptonewsarabia/",
    "overview": "https://cryptonewsarabia.com"
  },
  {
    "name": "Al Noran Securities Brokerage",
    "link": "https://www.linkedin.com/company/al-noran-securities-brokerage/",
    "overview": "Al Noran Securities Brokerage is a financial services company based out of Building 2, Cairo, Cairo, Egypt."
  },
  {
    "name": "Arabic Analytics/ FBS",
    "link": "https://www.linkedin.com/company/fbs-egypt/",
    "overview": "NON"
  },
  {
    "name": "Ecowaves Consultancy",
    "link": "https://www.linkedin.com/company/ecowaves-consultancy/",
    "overview": "Ecowaves Consultancy offers technical analysis for all kinds of grains such as Corn,Soya,etc...inside Egypt.\n"
  },
  {
    "name": "BPT Social",
    "link": "https://www.linkedin.com/company/bpt-social/",
    "overview": "\nWhat’s BPT Social\n\nBPT Social is a social trading network that connects Forex traders all over the world. In BPT Social you can improve your own experience following the Top traders, analyze their performance, and start creating your auto copy portfolio, copying their trading activities in real time with your own risk limits.\n\nOur mission is to provide a fully functioned network that connects all types of traders with any level of experience in one place, in which everyone can utilize the best of the provided data, ideas and trading activities to enrich his knowledge and maximize his gains. Together we can make a better trading experience. Trade Together, Trade Better.\n"
  },
  {
    "name": "Medic Accountants",
    "link": "https://www.linkedin.com/company/medic-accountants/",
    "overview": "The first and unique organization organization in Egypt and the Middle East specialized in Medical Accounting .."
  },
  {
    "name": "Capitevu",
    "link": "https://www.linkedin.com/company/capitevu/",
    "overview": "Capitevu is a financial services company located at the heart of Cairo, Egypt which offers ‎many services such as hedging physical precious metals & agriculture positions to avoid ‎market fluctuation. We are specialist consultant in gold trading either physical or Virtual ‎through spot & future markets. We can offer a unique service like creating your online ‎trading platform which your clients can trade Commodities, Currencies & Cryptocurrencies ‎which you can control prices, spreads, commission, swaps, …. etc. ‎"
  },
  {
    "name": "Best Way Business",
    "link": "https://www.linkedin.com/company/best-way-business/",
    "overview": "شركة  متخصصة  فى ادارة  الاعمال  التجارية  وتاسيس اعمال  جديدة  وادارة الاستثمار  للشركات  القائمة  "
  },
  {
    "name": "Cairo Funds Management",
    "link": "https://www.linkedin.com/company/cairo-funds-management/",
    "overview": "Cairo Funds Management is a financial services company based out of Building 4, Cairo, Cairo, Egypt."
  },
  {
    "name": "TA3WEEM.com",
    "link": "https://www.linkedin.com/company/ta3weem.com/",
    "overview": "TA3WEEM.com is the 1st website in Egypt to aggregate foreign exchange rates across banks in the country. Aiming to fill an important information gap, the website was launched just hours following the Egyptian Central Bank's decision to float the Egyptian pound, in order to provide both businesses and individuals with access to reliable, real-time, automatic exchange rate updates. In addition to the website, Android and iOS applications are also available for mobile users.\n\nFor business inquiries kindly contact us at hello[at]ta3weem.com"
  },
  {
    "name": "I Analyzer",
    "link": "https://www.linkedin.com/company/financialpractice/",
    "overview": "NON"
  },
  {
    "name": "TradingSpine",
    "link": "https://www.linkedin.com/company/tradingspine/",
    "overview": "Although offline trading activities like money management and trade sizing play a huge role in profitable Forex trading, most tools available online are only focusing on the on-chart activities. We wanted to fill that gap with a toolkit that will take care of all Forex trading activities and help the user to trade consistently without falling in emotional traps that comes as a result of focusing only on the charts."
  },
  {
    "name": "A A Financial World",
    "link": "https://www.linkedin.com/company/financial-game/",
    "overview": "Our vision in business administration is based on the staff. We believe that the staff holds high experiences during long years supported with training on the highest levels. It is a staff on which you can depend to achieve the best growth in the customer performance. Our growth is related to the growth of our customer. Knowledge of the most accurate details of the activity of our customer, and the good examination of the nature of activity would always help us execute our duties in professional means that gain the satisfaction of our customer and esteem and respect of the other foreign parties.\n"
  },
  {
    "name": "Sky Financial Solutions.",
    "link": "https://www.linkedin.com/company/sky-financial-solutions-/",
    "overview": "Welcome to Sky Financial Solutions, an international online Forex and CFD trading firm offering 24 hour access to a diverse range of trading products including foreign exchange, commodities, futures and indices."
  },
  {
    "name": "Gateway Finance and Consulting Ltd",
    "link": "https://www.linkedin.com/company/gateway-consulting1/",
    "overview": "With over 30 years experience in the accounting profession, we're well placed to assist in your next business purchase, acquisition or merger.  We can also proactively find your next business depending on your requirements."
  },
  {
    "name": "ASHERIF for Financial Services Consultancy",
    "link": "https://www.linkedin.com/company/asherif-for-financial-services-consultancy/",
    "overview": "Since ASHERIF was created in 2016, we’ve helped both; our corporate and family business clients to face real world treasury issues. Our team of senior consultants are in fact experienced corporate practitioners who have “hopped the desk” to the consulting side. ASHERIF are known not only for their expertise in the treasury space, but also for their responsiveness to client issues, thorough follow-through on each project, and general likability as temporary team members of your staff.\n\nASHERIF specialize in managing both your financial and investment risk. We provide you with strategic advice for hedging and structuring and arranging debt, as well as a range of other solutions, that are tailored to your industry and your business ambitions. We aim to add value, rather than simply managing the downside risks. Our skilled financial markets specialists draw on wide-ranging expertise to deliver bespoke, strategic solutions specific to your sector. Our swift process, straightforward delivery and innovative solutions enable us to build long-standing relationships with clients over a range of sectors. With offices in Canada, UAE, Egypt and Argentina our team of experts are always close at hand.\n\nOur focus centers on maintaining true expertise in the treasury space. Through constantly refreshing our knowledge and intentionally learning about leading solutions, our understanding is both global in scope and rich in detail. We pride ourselves on building long-lasting relationships with companies and organizations, always ensuring that we are able to bring the best insights and solutions to help them tackle whatever critical issues they may face.\n\nWe have the Regional Firms largest concentration of expertise including former Treasurers, Analysts, Risk Managers, Traders and Finance professionals. We have been recognized as the fastest growing Corporate Treasury service provider in 2017."
  },
  {
    "name": "Middle East Rating and Investors Service S.A.E.",
    "link": "https://www.linkedin.com/company/middle-east-rating-and-investors-service-s-a-e-/",
    "overview": "Middle East Rating and Investors Service S.A.E. is a financial services company based out of Giza, Egypt."
  },
  {
    "name": "Concord Corporate Finance",
    "link": "https://www.linkedin.com/company/concord-corporate-finance/",
    "overview": "Concord Corporate Finance is a financial services company based out of Concord Corporate Finance Building, Cairo, Cairo, Egypt."
  },
  {
    "name": "Diwanak",
    "link": "https://www.linkedin.com/company/diwanak/",
    "overview": "NON"
  },
  {
    "name": "المستشار المالي",
    "link": "https://www.linkedin.com/company/consultmoney/",
    "overview": "المستشار المالي للاستشارات المالية المبنية على أصول علمية، وتجربة عملية طويلة الأمد.\n"
  },
  {
    "name": "Yalla",
    "link": "https://www.linkedin.com/company/yallainc/",
    "overview": "Payments solutions provider"
  },
  {
    "name": "بوابة الأسعار",
    "link": "https://www.linkedin.com/company/al-jurnal/",
    "overview": "بوابة الأسعار\nتعرض سعر الذهب والعملات والدولار مع تحديث يومي على مدار الساعة"
  },
  {
    "name": "Vision Consulting - Ahmed Mahrous",
    "link": "https://www.linkedin.com/company/vision-consulting---ahmed-mahrous/",
    "overview": "Audit & Tax Consultancy firm , providing smart solutions to corporate bodies in all kinds of taxes ."
  },
  {
    "name": "Faratrade",
    "link": "https://www.linkedin.com/company/faratrade/",
    "overview": "فراترید یکی از پرتلاش‌ترین و بروزترین وبسایت های آموزشی در سطح ایران است که همیشه تلاش کرده تا بتواند جدیدترین و بروزترین مقالات و دوره‌های آموزشی را در اختیار علاقه‌مندان ایرانی قرار دهد. تبدیل کردن معامله گران ایرانی به بهترین معامله گران جهان هدف ماست\n\n"
  },
  {
    "name": "ارتقاء لدراسات الجدوى",
    "link": "https://www.linkedin.com/company/%D8%A7%D8%B1%D8%AA%D9%82%D8%A7%D8%A1-%D9%84%D8%AF%D8%B1%D8%A7%D8%B3%D8%A7%D8%AA-%D8%A7%D9%84%D8%AC%D8%AF%D9%88%D9%89/",
    "overview": "“ارتقاء” شركة مُتخصصة في الاستشارات الاقتصادية ودراسات الجدوى وتصفية الأصول، تعمل “ارتقاء” لمجموعة واسعة من العملاء، حيث يتنوع عملاؤنا بين الحكومات والشركات متعددة الجنسيات، والشركات المحلية والمؤسسات المالية والناشئة، لــــ تقديم المشورة والحلول الاستثمارية، فنحن نشارك رواد الأعمال طريقهم إلى الاستثمار المربح، كما أننا ملتزمون بتقديم خدمة وحلول لعملائنا على مستوى عالمي، من خلال اعتمادنا على فريق من المستشارين ذو خبرة في مجال الاقتصاد تؤهلهم لرسم صورة مُتكاملة وصحيحة لاحتياجات كل شركة سواء شركات كبرى أو متوسطة أو ناشئة، من خلال جمع البيانات والمعلومات التي تساعد في القيام بالتوقعات المالية التقريبية، و تقديرات تستند إلى متوسطات السوق في صناعتك، وهذا يساعدنا على إنشاء روابط طويلة الأمد مع عملائنا، لأننا نعلم أن نجاحنا هو انعكاس مباشر لنمو عملائنا ونجاحهم.\n"
  },
  {
    "name": "Renttus",
    "link": "https://www.linkedin.com/company/renttus/",
    "overview": "We make renting simple, secure, and intuitive for landlords and renters."
  },
  {
    "name": "ChartDepth",
    "link": "https://www.linkedin.com/company/chartdepth/",
    "overview": "Chartdepth.com is applying Artificial Intelligence to forecast market trends with up to 85% accuracy. Our work is rooted in the application of artificial intelligence technologies to intermarket analysis of today’s globally interconnected financial markets, utilizing a powerful, mathematical tool known as neural networks."
  },
  {
    "name": "iHub - Innovation Hub",
    "link": "https://www.linkedin.com/company/ihubmenoufia/",
    "overview": "iHub started as a resource for students interested in entrepreneurship and innovation. iHub resources provide the required support for students to grow their skills, ideas, and ventures at any stage of development and cover a wide range of disciplines.\n"
  },
  {
    "name": "Commodity Capital Markets",
    "link": "https://www.linkedin.com/company/commodity-capital-markets/",
    "overview": "Supporting the FX and Commodities industry in the MENA region through high quality customer service and sales support. "
  },
  {
    "name": "workngopro",
    "link": "https://www.linkedin.com/company/workngopro/",
    "overview": "work part/full time from home and get paid monthly."
  },
  {
    "name": "TANWEEA CONSULTANCY & INVESTMENT",
    "link": "https://www.linkedin.com/company/tanweea-consultancy-investment/",
    "overview": "Tanweeais a comprehensive, professional and integrated platform provides all financial needs and solutions for investors and decision makers in Egypt and GCC investment & stock markets."
  }
]
